<script>
import { onMounted, onBeforeUnmount, ref, watch } from "vue";
import { useRouter, useRoute } from "vue-router";
import apiService from "@/service/api-service.js";
import { Vue3Marquee } from "vue3-marquee";

export default {
  components: {
    Vue3Marquee,
  },
  setup() {
    const router = useRouter();
    const storyModalData = ref({ title: "", content: "" });
    const contentModalData = ref({
      title: "",
      content: "",
      img_url: "",
      social_media_link: "",
    });
    const contentModalYTOpened = ref(false);
    const animatedNumber = ref(0);
    const stories = ref([[], [], [], []]);
    const storiesMobile = ref([[], []]);
    const runMobileMarquee = ref(false);
    const storiesForm = ref({
      car_owner_name: "",
      license_plate: "",
      contact_phone: "",
      contact_email: "",
      recommendation_title: "",
      recommendation_content: "",
      social_media_link: "",
      carPhotoUpload: null,
      ownerPhotoUpload: null,
      ownerPhoto2Upload: null,
    });
    const checkPolicy = ref(false);
    const owner_photo = ref(null);
    const owner_photo2 = ref(null);
    const car_photo = ref(null);
    const owner_photo_preview = ref(null);
    const owner_photo2_preview = ref(null);
    const car_photo_preview = ref(null);
    const randomSpeedMobileLeft = ref(60);
    const randomSpeedMobileRight = ref(60);
    const randomSpeedPCLeft1 = ref(40);
    const randomSpeedPCLeft2 = ref(40);
    const randomSpeedPCRight1 = ref(40);
    const randomSpeedPCRight2 = ref(40);
    const menuVisible = ref(false);
    const toggleMenu = () => {
      menuVisible.value = !menuVisible.value;
    };

    const formErros = ref({
      car_owner_name: "",
      license_plate: "",
      contact_phone: "",
      contact_email: "",
      recommendation_title: "",
      recommendation_content: "",
      social_media_link: "",
      carPhotoUpload: "",
      ownerPhotoUpload: "",
      ownerPhotoUpload2: "",
      checkPolicy: "",
    });

    let cleanupInterval;

    const triggerOwnerPhotoUpload = () => {
      owner_photo.value.click();
    };

    const triggerOwnerPhoto2Upload = () => {
      owner_photo2.value.click();
    };

    const triggerCarPhotoUpload = () => {
      car_photo.value.click();
    };

    const youtubeEmbedUrl = ref("");

    const contentModalSetData = (
      title,
      img_url,
      content,
      social_media_link = ``
    ) => {
      contentModalData.value = {
        title: title,
        content: content,
        img_url: img_url,
        social_media_link: social_media_link,
      };

      if (social_media_link.length > 0) {
        if (social_media_link.includes("youtube")) {
          contentModalData.value.social_media_link = `https://www.youtube.com/embed/${new URL(
            social_media_link
          ).searchParams.get("v")}`;
        }
      }
    };
    const storyModalSetData = (title, content) => {
      storyModalData.value = {
        title,
        content,
      };
    };
    const animateNum = () => {
      const targetNumber = 12357;
      const duration = 5000;
      const stepTime = Math.abs(Math.floor(duration / targetNumber));
      const slowDownPoint = 9000;
      const slowDownFactor = 50;

      const timer = setInterval(() => {
        animatedNumber.value += slowDownFactor;

        if (animatedNumber.value >= targetNumber) {
          animatedNumber.value = targetNumber;
          clearInterval(timer);
        }
      }, stepTime);
    };

    const getStories = async () => {
      try {
        // 檢查網址是否為 *.hanyuan.info
        const isHanyuanDomain =
          window.location.hostname.endsWith("hanyuan.info") ||
          window.location.hostname === "localhost";

        let results;
        if (isHanyuanDomain) {
          results = [
            {
              id: 206,
              recommendation_title: "終於有大空間了",
              recommendation_content:
                "原本舊車開了很多年，兩位小朋友長大後空間確實有點不夠，後來為了考量的空間感終於找到喜歡的車子，當初試乘時，兒子一上車就說我都不用彎腰感覺好輕鬆，這也是下訂的理由之一，等了一段時間終於交車，雖然才入手沒多久，但老婆跟兩位小朋友都很滿意",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1746437445_圖片2.jpg",
            },
            {
              id: 203,
              recommendation_title: "三代卡司行",
              recommendation_content:
                "屢次假期出遊去，因為成員的關係，開車只好分兩批，自從有了 CUSTIN ，顛覆傳統廂型車，改寫家庭房車系，視覺性能安全性，空間寬敞大無比。\r\n配合先進的科技，一千五渦輪引擎，車身長達近五米，輕鬆駕馭樂不疲，一家七口座一起，各個都有專屬椅，要坐躺平皆適宜，一鍵輕鬆搞定，遙控靠近車柱 C，滑門自動來開啟，尾門也不用腳踢，人鑰近距就掀起，提升用車人便利。有了 CUSTIN 參與，行駛到婉蜒崎嶇，不再嘔吐與頭暈，幸福旅途有了你，天天都想出遊去，享受天倫之樂趣。車外美景收眼底，車內歡樂聲響起，三代同堂的溫馨，心中歡樂與甜蜜，再多金錢無法比，感謝現代 CUSTIN ，留住美好的回憶。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1746437230_１.jpg",
            },
            {
              id: 201,
              recommendation_title: "陶哲晨蕾的好家人",
              recommendation_content:
                "我家的CUSTIN名字叫小卡，一直以來家裡的車是我們全家的好夥伴，選擇CUSTIN主要是空間大舒適，車內寧靜度好，動力性能好，安全性能佳，載著我們上山下海、颳風下雨都靠它，一台能夠載著全家三代的好車，讓我們全家好幸福。❤️",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1745820149_生活照1.jpg",
            },
            {
              id: 200,
              recommendation_title: "為你沒有遺憾",
              recommendation_content:
                "20230917選擇結婚紀念日來取車，終於可以一家六人一起舒服出遊，你總是不好意思跟我們出門，總說小孩長大坐車太擠，七人座剛好。\r\n每個星期日我們開心😃，持續二年超過100次我們沒有缺席，帶你走過很多地方，每一次都帶你去到定點放你在最近的地方，不用走很多路，你欣賞美景吃美食，開心渡過最後羅癌末期。\r\n你好嗎？這星期🈵百日。\r\n媽媽，為你我們努力過，所以沒有遺憾。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1745820305_圖片2.jpg",
            },
            {
              id: 199,
              recommendation_title: "與大甲媽的約定",
              recommendation_content:
                "每年的三月瘋媽祖是我們固定的行程，媽祖起駕後的第一個星期一便是我們跟著媽祖的腳步前往新港拜祖的日子，自從換了這部CUSTIN後就變成了可以全家一起出發的好夥伴，帶著大甲媽祖的進香旗，跟隨著媽祖的腳步一站一站的前行，追隨著我們的信仰，也完成了跟大甲媽的約定",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1745225563_圖片1.jpg",
            },
            {
              id: 194,
              recommendation_title: "Custin的好只有車主才知道",
              recommendation_content:
                "上武嶺 去環島 去露營 大空間配備好馬力夠 價格親民 是台很棒的車",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1742971975_圖片2.jpg",
            },
            {
              id: 193,
              recommendation_title: "開車大吉，貓咪也想搭",
              recommendation_content:
                "駕駛著全新的 Hyundai Custin，排隊等待新車祈福過火儀式，悠閒欣賞著熱鬧的街景與紅燈籠高掛的農曆春節氣氛。車內的先進儀表板顯示著平穩的駕駛狀態，對這輛車的舒適感受相當滿意。\r\n\r\n工作午休時，買完午餐進入駕駛座，突然發現擋風玻璃上多了一位「不速之客」——一隻陌生的虎斑貓輕盈地跳上車前緣，睜大眼睛好奇地打量著我的Custin。牠掛著項圈，看起來像是附近居民的愛貓，卻毫不膽怯地踏著車前，仿佛在審視這輛新車是否合格。直到我輕輕按了幾下喇叭，貓咪這才優雅地轉身跳下，留給我一段特別又逗趣的駕駛回憶。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1742801900_生活照2.jpeg",
            },
            {
              id: 190,
              recommendation_title: "最終的乘載",
              recommendation_content:
                "我們原本是豐田的車主，在電視的廣告中被Custin優雅霸氣的外表和寬敞的乘坐空間所吸引，索幸剛好想換車讓高齡的公婆易於上車搭乘，於是決定入列待車行列中，歷經漫長等待終於在四個月後迎來夢想中的新車，在待車的期間婆婆因跌倒臥床無緣搭乘，公公與娘家的媽媽都對Custin的舒適乘坐空間讚不絕口，最令人感到遺憾的是婆婆在擁車後八個月不幸去逝，無緣搭乘只有在她老人家化為一甕骨灰時送婆婆最後一程，這真是趟最終的乘載令人哽咽，筆落至此。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1742550541_圖片1.jpg",
            },
            {
              id: 189,
              recommendation_title: "與我同行",
              recommendation_content:
                "自從換了Custin之後，小孩都很喜歡，上山下海都有Custin作陪，玩累了上車就可以好好休息，到下一個點又可以精力滿滿的繼續玩樂。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1742375799_圖片2.jpg",
            },
            {
              id: 188,
              recommendation_title: "家人與Custin的相遇",
              recommendation_content:
                "第一台車給了Custin\r\n開著最愛的車，載著最愛的家人，到處走走逛逛，舒適的乘坐感，家人一上車就直接睡著了，心裡就覺得心滿意足🥰",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1742375790_圖片1.jpg",
            },
            {
              id: 187,
              recommendation_title: "我們這一家與CUSTIN的故事",
              recommendation_content:
                "至從買了CUSTIN,我們全家五人就開啟了與CUSTIN的連結了，他為我們遮風擋雨，保護我們全家的安全，讓這個世界變得更美好，當初如果沒有選擇CUSTIN,或許這段旅程可能沒有了開始。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1742188129_圖片1.jpg",
            },
            {
              id: 186,
              recommendation_title: "笑容",
              recommendation_content:
                "升格成了父母，帶著雙方的父母與兩個寶寶，用這台車開啟每一次出遊的舒適回憶，並期待著下一次的旅程",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1742188024_生活照1.jpeg",
            },
            {
              id: 183,
              recommendation_title: "未來的老闆娘",
              recommendation_content:
                "每次出門，爸爸媽媽總是為了自己的子女安全與舒適著想，2024這年想換台舒適一點的車，無意間看到了這台Custin，馬上預約看車與試乘，在業務專業的介紹下，感覺這台車很適合目前我要的，馬上簽約，足足等了三個月才交車，現在出門旅遊看到小孩坐的很舒適，就感覺這錢花的很值得。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1742181037_生活照2.jpg",
            },
            {
              id: 182,
              recommendation_title: "乘載幸福的車",
              recommendation_content:
                '一部乘載著"家的幸福",當初選擇Custin,一來家中乘員較多，二來除了接送家中寶貝上、下學，也是出門旅遊的相當不錯的交通工具，再來因工作關係，有時還需擔任送貨的任務，所以也占據大部分的時間。\r\n除了短暫時間與小朋友分享上、下學校點滴，因大空間出外踏青還能攜帶所需的衣物及物品，所以除了乘載*家的幸福*外，更是家中不可缺一的生活伴侶，有你真好。',
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1741679554_生活照1.jpg",
            },
            {
              id: 176,
              recommendation_title: "櫻花🌸",
              recommendation_content:
                "每到一個美麗的景點，都不忘幫，也是家裡一份子的CUSTIN紀錄每一個美麗的地標～",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1741156789_圖片1.jpg",
            },
            {
              id: 175,
              recommendation_title: "闔家歡樂一同郊遊趣",
              recommendation_content:
                "自從買了Custin後，我們一家大大小小出遊的機率更頻繁了！\r\n喜歡大家熱熱鬧鬧聚在一起的氛圍，能這樣大家團聚出遊真的很棒很幸福！\r\n一家五口再加上長輩一台車就直接出遊不需再多開一台車，說走就走去哪都開心。\r\n車子真的很舒適，也很好開。以前開個車開較遠程小孩就會哇哇叫怎麼這麼遠，要坐好久，但自從換了Custin後因為座椅太舒適，一家在車上熱熱鬧鬧玩得太開心都不會覺得路途很遙遠了，甚至環島也開心！所以我們出遊機會更多，全台四處趴趴走，也一路認識了不少車友，更值得誇讚的是，因為擁有這台車後還有很多機會參加車聚，適合家庭出遊的車，連車聚都辦得有聲有色，完全符合我們家庭，實在太慶幸了！",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1741156755_圖片2.jpg",
            },
            {
              id: 174,
              recommendation_title: "陪伴我人生後半段",
              recommendation_content:
                "人生的下半段精彩故事就由Custin來陪伴我們一家人繼續走下去 👍",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1741060367_圖片1.jpg",
            },
            {
              id: 173,
              recommendation_title: "戴著思念的Custin",
              recommendation_content:
                "去年，老婆傳來了第二胎的好消息，想想家裡的老瑞獅，看著家裡同住的岳母以及住在內湖的老爸老媽和未來出門至少2大加兩張安全座椅，想再坐第5人根本不可能，確立了放好小孩仍能進出第3排的MPV車型，於暑假就下訂大小勉強可以停路邊車格，又能舒適承載7人的Custin，沒想到11月老婆緊急剖腹，第2隻小可愛提早來到人世，但因為不明原因無法自主呼吸，在出生2天後便結束短短的人生，就在這天接到了新車通知，當下真心痛苦，當初為他而訂的車卻在他走了的時侯到來，幾番掙扎還是牽了回家，看著原本應該滿座的第二排不明悲傷，今年1月，原本空著的位置在南下探親時滿載大舅子一家和令岳母，2月帶著岳母姐妹們泡溫泉，現在，車子滿了",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1741060258_圖片1.jpg",
            },
            {
              id: 171,
              recommendation_title: "幸福安親班交通車",
              recommendation_content:
                "我是員林國小對面的昱昇補習班，因為要接員東國小的學生下課來上安親班，需要一台交通車！在我精挑細選之下，Custin是我萬中選一的溫馨豪華車！學生非常開心舒服的坐著中排豪華坐椅臉上露出滿滿驕傲幸福的笑容！連學校老師都覺得在昱昇補習班上課可以坐如此頂級舒適的坐椅，真的幸福滿分💯！為昱昇補習班的形象加分滿滿～^_^",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1742439977_圖片1.jpg",
            },
            {
              id: 165,
              recommendation_title: "家用神車",
              recommendation_content:
                "同級價位首選\r\n家用的大空間\r\n配備盡完美",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740986049_生活照2.jpg",
            },
            {
              id: 159,
              recommendation_title: "讓我們家庭旅程更精彩",
              recommendation_content:
                "身為一個重視家庭的車主，選擇一台適合全家出遊的車對我來說至關重要。自從擁有Custin，每一次的家庭旅行都變得更輕鬆更快樂\r\n這次我們駕駛 Custin 來到山林秘境，一家大小三代同堂，滿滿的親子時光。Custin 的大空間與舒適座椅，讓孩子們可以自在地坐著躺著，連長途旅行也不覺得疲累。電動側滑門 更讓載送家人變得輕鬆，尤其是對帶著小孩的父母來說簡直是神隊友\r\n旅途中Custin 的靜肅性與穩定的駕駛感 讓我們可以安心聊天、聽音樂，享受沿途風景\r\n這趟旅程不只是一次出遊更是家人間美好回憶的累積。謝謝 Hyundai Custin，讓我們的家庭旅程更加精彩，每一次啟程都充滿期待",
              owner_photo: null,
            },
            {
              id: 158,
              recommendation_title: "滿滿幸福的小藍",
              recommendation_content:
                "妹妹一句，爸爸我可以站在車上，讓我們決定上手我們的Custin小藍，從此在小藍車上皆充滿歡樂與回憶，舒適的小藍總讓小孩有個舒適的車上空間，Custin讓我們無可挑剔！",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740985876_生活照1.jpeg",
            },
            {
              id: 157,
              recommendation_title: "就是這台車！！！",
              recommendation_content:
                "想換車 ，家中加上媽媽，總共有6個人，所以開始想找一台滿意的七人座 ，某次去台東玩，看見一台車 ，一秒覺得，這個外型，就是心中想要找尋的七人坐車子，馬上拿出手機搜尋，是現代的CUSTIN，回到屏東後，很快的就去現代汽車賞車了。\r\n一看見實車就很滿意，第二次去看，試乘後，就直接下訂了，完全沒有去看過其他廠牌，就決定買下這台七人坐。\r\n開著這台車，四處玩，釣魚也很合適，座位很舒適，全家都很滿意，未來，要再開著我們這台心中滿意的CUSTIN，繼續玩透透！",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740985830_圖片1.jpg",
            },
            {
              id: 142,
              recommendation_title: "Custin",
              recommendation_content:
                "我個人覺得Custin真的是CP值很高的車，稅金也很省空間又大，油耗我個人覺得還好畢竟車那麼重，引擎才1.5CC我個人覺得算省油了如果沒辦法接受Custin那也只能加預算往上買到阿爾法或LM，所以我覺得Custin我是給蠻高的評分",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740559361_圖片2.jpg",
            },
            {
              id: 141,
              recommendation_title: "神帶我遇Custin",
              recommendation_content:
                "當初家庭的需要，我們要找一台7人座車子，意外從親戚那得知Custin，去展間試完車沒多久就訂購了～CP值高的車，讚👍",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740559433_生活照1.jpg",
            },
            {
              id: 140,
              recommendation_title: "給最愛的家人頂級的乘坐享受",
              recommendation_content:
                "去年要換車時我的首選原本是日系SUV車款，但老婆考慮到家人乘坐空間傾向MPV車款。為了迎合老婆的要求，便到住家附近的展示中心看Hyundai Custin車款，映入眼簾的是大器的豪華外型以及簡約、前衛風格的設計美學，深深吸引我的目光。\r\n上車試坐後發現乘坐空間非常的寬敞，全車皮椅更構成科技豪華的內裝氛圍，而頂級的VIP車款有雙邊電動側滑門上下車更安全舒適，第二排座椅擁有皇家VIP等級的電動調整及通風加熱功能，還有全套先進的駕駛輔助及完備的安全配備，確實顛覆了以前對韓國車的刻板印象，而為了給最愛的家人頂級的乘坐享受，這也是最後選擇Hyundai Custin的最大理由。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740463168_圖片2.jpg",
            },
            {
              id: 139,
              recommendation_title: "當我們Custin串在一起",
              recommendation_content:
                "愛上Custin大家庭，每年群組發起一次的大會師，有400台霸氣壯觀畫面，車友不私藏的改車分享，各個區域也不定時一同出遊、一同做公益的活動，因為有車友們，生活變得多采多姿。為了家庭孩子、又可認識各式各樣的朋友～購買Custin非常值得。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740463137_圖片3.jpg",
            },
            {
              id: 138,
              recommendation_title: "一台製造全家回憶的車",
              recommendation_content:
                "家人陪伴的時候，一台需要滿載家人回憶的車出現了，經歷了半年的等待，永遠記得首次出遊前往九族文化村，當時Custin車輛總數還沒那麼多，開過去路人出現了讚嘆的聲音，小朋友坐在車內總是可以安靜的睡覺玩耍，這台車真是值得推薦",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740463114_圖片1.jpg",
            },
            {
              id: 135,
              recommendation_title: "三代同堂出遊",
              recommendation_content:
                "婚前原本開小轎車，隨著情侶踏入了婚禮殿堂後然而有一個小生命誕生，才慢慢發覺到車子空間怎麼越來越壓迫了，每次一到假日可以三代同堂出遊還可以勉強歡樂抵達目的，隨著二寶來到，到了假日時會捨棄父母，帶著兩寶出遊，日子久了知道這不是我想到的出遊，於是騙騙父母去現代試駕Custin 說試駕不用錢去坐坐，試駕後父母對於Custin評價很高，在試駕後一個禮拜後立刻下單，來繼續我們的三代同堂出遊，一起玩遍全台灣啦",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740380682_生活照2.jpg",
            },
            {
              id: 134,
              recommendation_title: "Sweet Custin",
              recommendation_content:
                '原本開Focus載著一家三口~忽然一下子甜蜜的幸福來太快\r\n2、3寶接連報到~ Focus的空間直接無法承擔~\r\n看了很多款7人座,不是不舒服、空間小、不然就是太商務\r\n剛好遇到CUSTIN上市,試乘了兩次就直接下單排隊了~\r\nCUSTIN整個就是為了家庭量身訂做的車款\r\n空間適中,可以帶兩台推車,二排椅子又是同級距無敵~\r\n每次出遊,就是老話一句"上車睡覺、下車尿尿"\r\n不論是妻子、孩子都很愛這台車~\r\n載著我們一家人上山下海到處遊玩~\r\n很開心一家五口加上CUSTIN組成的甜蜜家庭~',
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740380648_67b9ce952eeb3_IMG20230817084922.jpg",
            },
            {
              id: 133,
              recommendation_title: "第一次帶媽媽坐Custin出遊",
              recommendation_content:
                "很高興年前取車，年初三去板橋載媽媽一起去紫南宮走走。媽媽一上車就說座位好舒服，沒多久媽媽就睡著了。 一直開心的使用一些座位旁的按鍵。 媽媽一定很開心我們第一次買新車吧！之前那台五人座二手車媽媽跟兩個女兒擠在後座動彈不得\r\n一天下來，車上五個人開心聊天，也吃了好吃的食物。買一些紫南宮老街的伴手禮。 載媽媽回板橋。 結束我回娘家的一天，我們一家四口也開心的回宜蘭\r\n年假我們天天開著Custin到處去玩，很開心因緣際會之下在中和買到車業務人超熱情的，跟我們宜蘭的業務真的差很多\r\n現在使用這台車滿一個月了。 結論是很開心老公做了很久的功課確定買了它，搭過它的評價都超好的好開心",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740380612_67b9b56bc4643_image0.jpeg",
            },
            {
              id: 132,
              recommendation_title: "幸福就是如此簡單",
              recommendation_content:
                "看著小孩在車上睡的如此香甜就值得了\r\n隨著小孩長大就要Custin帶我們去旅行\r\n值得推薦一下囉",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740380578_67b99d3c7e5bc_IMG_6917.jpeg",
            },
            {
              id: 131,
              recommendation_title: "Custin我的大家族",
              recommendation_content:
                "因為這台Custin讓我認識了很多車友！\r\n從原本車主賴群300多人加入到現在、已經3400多人、我從默默無名的車友、變成管理者、再變成會長、讓我舉辦了第三屆大會師400台成就！解鎖！\r\n也讓我帶著家人一同遊玩同樂！買這車很棒！",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740380550_c_1740380526.jpg",
            },
            {
              id: 129,
              recommendation_title: "一台載滿歡樂的車子",
              recommendation_content:
                "Custin是一台可以讓我載滿三代同堂的好車，我要分享的是小時候的我都會看到鄰居一家老小開著車子出遊，小時候的我常常羨慕別人家都可以一家大小坐著車子出遊去玩樂，因為本身家庭算大家庭爸爸媽媽生了我們一家7口 ， 所以更不用說可以一起出遊玩了 ，因為爸爸長期在外面工作媽媽是家庭主婦，我告訴自己以後長大一定要買一台可以載滿一家出遊的車子，終於讓我第一眼看到我就喜歡上的車子，上網爬文看到在2022年11月8號上市，當時我們中部展示車還沒配到所以當時就還沒辦法試乘到車子，於是我們就等到2023年的2月直接去彰化試乘，載著一家大小試完車子看著家人們滿臉笑容，當天立馬下訂等著漫長等待4月終於配到車子了",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740380501_黃.jpg",
            },
            {
              id: 128,
              recommendation_title: "幸福的移動家園",
              recommendation_content:
                "在一個陽光明媚的早晨，我們一家決定開著現代Custin 7人座MVP房車，來一場久違的家庭旅行。這輛車不僅是我們的交通工具，更是我們家庭生活的重要一部分。當我打開車門，孩子們興奮地跳上車，選擇自己喜歡的座位。寬敞的車內空間讓每個人都感到舒適自在，甚至連我們家的狗狗也有自己的專屬位置。我太太坐在副駕駛座上，微笑著看著這一切。一路上，車內充滿了孩子們的笑聲和音樂聲。現代Custin的先進音響系統讓每一首歌曲都變得更加動聽。我一邊開車，一邊和家人分享著我年輕時的旅行故事，孩子們聽得津津有味。\r\n現代Custin 7人座MVP房車，不僅僅是一輛車，更是承載著我們一家人幸福與回憶的移動家園。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740380316_生活照2.jpeg",
            },
            {
              id: 127,
              recommendation_title: "全家出遊沒煩惱一人一位剛剛好",
              recommendation_content:
                "因家中人數增長，為了可以全家人一起出遊，所以選擇換了cp質超高的Custin 7人座。\r\n全家出遊沒煩惱，一人一位剛剛好。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740380261_林致豪.jpg",
            },
            {
              id: 126,
              recommendation_title: "承載幸福的家庭房車",
              recommendation_content:
                "當初選擇CUSTIN時，我就被它的寬敞舒適和貼心設計吸引。身為一位熱愛旅行與家庭生活的車主，CUSTIN不僅成為我日常通勤的好夥伴，更是全家出遊的最佳選擇。\r\n記得有一次，我們全家臨時決定來一趟說走就走的旅行。孩子們興奮地坐進車內，打開全景天窗，看著藍天白雲飄過；妻子則享受著後座寬敞的空間，輕鬆自在地滑著手機。長途駕駛最怕疲勞，但CUSTIN的舒適座椅與靜謐車室，讓我能專心駕駛，享受沿途風景，而不是擔心身體的疲憊。\r\n不論是日常接送家人，還是帶著親友出遊，CUSTIN總能讓每一次旅程變得更愜意、更美好。這不只是一台車，而是承載著我們幸福時光的移動空間，每一次發動引擎，都是一段美好回憶的開始！",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740380226_生活照2.jpg",
            },
            {
              id: 124,
              recommendation_title: "實現家庭和睦的一台好車",
              recommendation_content:
                "謝謝CUSTIN的記憶座椅讓腳短的我坐上駕駛座時，不用手動調整好久的座椅；讓怕冷又愛穿短褲的我，上車不用冰屁股；讓怕熱的老公不用再熱到背後起疹子；讓孩子們不再因為座位擠到彼此而吵架；一人一個王位，愛怎麼睡就怎麼睡；讓我們能帶著孩子們跟外婆舒服的出遊，交車不久後女兒在校不幸腳骨折了，謝謝這台車的大空間不僅可以載輪椅，還可以讓她打石膏的腳舒服的放在腳靠上，位置也夠大，不怕被其他乘客再撞到，這台車真的是我們家的命定車！謝謝有你CUSTIN❤️",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740380192_蔡.jpg",
            },
            {
              id: 121,
              recommendation_title: "人生第一台車",
              recommendation_content:
                "因為家庭及戶外需求選擇了七人車，原本不考慮現代，看到現代近幾年的進步選擇了現代，目前開到現在，車子非常好開，空間大小也很夠用，車身高度下地下室也不會有疑慮，露營載裝備的空間也非常足夠，Custin 是一台很不錯的車，現代的安全性也讓我載起家人更安心，豐富的主被動安全，不續用選配才能選到我要的安全，這是一台讓人不會後悔的車",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740379867_圖片2.jpg",
            },
            {
              id: 120,
              recommendation_title: "前往幸福的車程",
              recommendation_content:
                "我是一位忙碌的爸爸，總是在城市生活被時間推著走。一直夢想能帶家人來一場自在舒適的旅行，但總是因為工作而一再延後。直到有一天，他在車展上遇見了 Custin，一款專為家庭設計的豪華 MPV。\r\n週末，終於帶著妻子和孩子開著新車出發。輕踩油門，Custin 的靜謐車艙與寬敞座椅讓全家人倍感舒適。孩子興奮地打開車內娛樂系統，妻子則欣賞著天窗外的藍天白雲。自動駕駛輔助系統讓李偉不再疲憊，我終於能放慢腳步，專心享受與家人在一起的時光。\r\n駛過蜿蜒的山路，遠方的湖泊映照著夕陽，停下車，看著孩子開心奔跑。這才明白，幸福並不只是終點，而是旅途中的每一刻。而 Custin，不只是車，更是一座移動的幸福空間。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740124059_蘇涴怡.png.jpg",
            },
            {
              id: 119,
              recommendation_title: "愛車愛妻愛孩的老爸",
              recommendation_content:
                "我們一家人都很愛這台車，尤其是開著這台車露營遊山玩水",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740123924_67b72b0363f32_IMG_9804.jpeg",
            },
            {
              id: 118,
              recommendation_title: "前往幸福的車程",
              recommendation_content:
                "我是一位忙碌的爸爸，總是在城市生活被時間推著走。一直夢想能帶家人來一場自在舒適的旅行，但總是因為工作而一再延後。直到有一天，他在車展上遇見了 Custin，一款專為家庭設計的豪華 MPV。\r\n週末，終於帶著妻子和孩子開著新車出發。輕踩油門，Custin 的靜謐車艙與寬敞座椅讓全家人倍感舒適。孩子興奮地打開車內娛樂系統，妻子則欣賞著天窗外的藍天白雲。自動駕駛輔助系統讓李偉不再疲憊，我終於能放慢腳步，專心享受與家人在一起的時光。\r\n駛過蜿蜒的山路，遠方的湖泊映照著夕陽，停下車，看著孩子開心奔跑。這才明白，幸福並不只是終點，而是旅途中的每一刻。而 Custin，不只是車，更是一座移動的幸福空間。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740123858_蘇涴怡.png.jpg",
            },
            {
              id: 117,
              recommendation_title: "家人的愛與custin",
              recommendation_content:
                "開著custin載著最愛的家人，到處旅遊、露營、品嚐美食，不管是旅途時家人期待、興奮的神情，或是回程途中家人坐在後座休息時舒適、安穩、滿足的臉龐，這都是駕駛感受到的，家人的愛，也是我的最愛，custin^o^。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740123777_李建德.png.jpg",
            },
            {
              id: 116,
              recommendation_title: "為了更好的體驗生活",
              recommendation_content:
                "本身是一家7口的三代同堂，原本有一台轎車，雖然平日接送小孩還算游刃有餘，但若是要總動員出門時，就是讓我感到困擾的時刻了，長輩都認為擠一下沒關係，但隨著小孩的成長，已經不是擠一下就能處理的了，更何況這還是違規、安全性的問題了，在這總總的取向需求之下，便開始尋找7人座的選項，kodiaq、5008、布丁狗還有carnival、outlander、sorento、custin等等……\r\n大多為5+2，，使用感受並不好，小孩大概只能坐國小以下較合適，carnival 的車型又太大，而最後就下訂了符合最多條件的custin，因為外型以及方便性以及安全性還有價位都是讓人感到心動的原因。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740123787_詹鈺蓉.png.jpg",
            },
            {
              id: 115,
              recommendation_title: "承載全家人的幸福生活",
              recommendation_content:
                "在交車前就規劃好武陵農場賞櫻行程，整段行程非常的愉悅幸福，也幸好貴公司能夠讓我們於新年前能交到車，也承載著全家人及幸福，欣賞美景😍CUSTIN是輛好車！",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740379755_圖片1.jpg",
            },
            {
              id: 112,
              recommendation_title: "前往幸福的車程",
              recommendation_content:
                "我是一位忙碌的爸爸，總是在城市生活被時間推著走。一直夢想能帶家人來一場自在舒適的旅行，但總是因為工作而一再延後。直到有一天，他在車展上遇見了 Custin，一款專為家庭設計的豪華 MPV。\r\n週末，終於帶著妻子和孩子開著新車出發。輕踩油門，Custin 的靜謐車艙與寬敞座椅讓全家人倍感舒適。孩子興奮地打開車內娛樂系統，妻子則欣賞著天窗外的藍天白雲。自動駕駛輔助系統讓李偉不再疲憊，我終於能放慢腳步，專心享受與家人在一起的時光。\r\n駛過蜿蜒的山路，遠方的湖泊映照著夕陽，停下車，看著孩子開心奔跑。這才明白，幸福並不只是終點，而是旅途中的每一刻。而 Custin，不只是車，更是一座移動的幸福空間。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740120104_蘇涴怡.png.jpg",
            },
            {
              id: 108,
              recommendation_title: "愛車愛妻愛孩的老爸",
              recommendation_content:
                "我們一家人都很愛這台車，尤其是開著這台車露營遊山玩水",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740120074_67b72b0363f32_IMG_9804.jpeg",
            },
            {
              id: 107,
              recommendation_title: "家人的愛與custin",
              recommendation_content:
                "開著custin載著最愛的家人，到處旅遊、露營、品嚐美食，不管是旅途時家人期待、興奮的神情，或是回程途中家人坐在後座休息時舒適、安穩、滿足的臉龐，這都是駕駛感受到的，家人的愛，也是我的最愛，custin^o^。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740120047_李建德.png.jpg",
            },
            {
              id: 106,
              recommendation_title: "為了更好的體驗生活",
              recommendation_content:
                "本身是一家7口的三代同堂，原本有一台轎車，雖然平日接送小孩還算游刃有餘，但若是要總動員出門時，就是讓我感到困擾的時刻了，長輩都認為擠一下沒關係，但隨著小孩的成長，已經不是擠一下就能處理的了，更何況這還是違規、安全性的問題了，在這總總的取向需求之下，便開始尋找7人座的選項，kodiaq、5008、布丁狗還有carnival、outlander、sorento、custin等等……\r\n大多為5+2，，使用感受並不好，小孩大概只能坐國小以下較合適，carnival 的車型又太大，而最後就下訂了符合最多條件的custin，因為外型以及方便性以及安全性還有價位都是讓人感到心動的原因。",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740120033_詹鈺蓉.png.jpg",
            },
            {
              id: 105,
              recommendation_title: "CUSTIN跟你一起走下去！",
              recommendation_content:
                "一位完美的爸爸！\r\n合一個完美的家庭！\r\n需要一台完美的七人座！\r\n就需要一台頂尖的CUSTIN！\r\n帶全家人上山下海，帶全家人走片天下。\r\n\r\n小孩一出生，出門旅遊大包小包，之前的小車位子根本不夠，換車的同時剛好看到現代的新出的CUSTIN ， 當下看到霸氣的車頭！潮流的車尾燈！鋁圈在跑時帥氣的忍者飛鏢的圖案！立馬跑去下定！",
              owner_photo:
                "https://api.custin-event.hyundai-motor.com.tw/storage/upload/1740048476_c_1740047604.jpg",
            },
          ];
        } else {
          // 如果不是 hanyuan.info 網域,呼叫 API
          results = await apiService.getStories();
        }

        stories.value = [
          results.slice(0, 5),
          results.slice(5, 10),
          results.slice(10, 15),
          results.slice(15, 20),
        ];

        storiesMobile.value = [results.slice(0, 10), results.slice(11, 20)];
      } catch (error) {
        console.log(error);
      }
    };

    const submitStory = async () => {
      try {
        const formCheck = checkForm();

        if (formCheck) {
          await apiService.postStories(storiesForm.value);
          alert("提交成功");

          //div id = closePostModal, closePostModal.click()
          const closePostModal = document.getElementById("closePostModal");
          closePostModal.click();
        } else {
          console.log(formErros.value);
        }
      } catch (error) {
        //check error is object
        if (typeof error === "object") {
          for (let key in error) {
            formErros.value[key] = error[key].join("<br>");
          }
        } else {
          alert("提交失敗");
        }
      }
    };

    const checkForm = () => {
      for (let key in formErros.value) {
        formErros.value[key] = "";
      }

      if (!checkPolicy.value) {
        formErros.value.checkPolicy = "請勾選同意";
      } else {
        formErros.value.checkPolicy = "";
      }

      return Object.values(formErros.value).every((error) => !error);
    };

    const handleCarPhotoChange = (event) => {
      storiesForm.value.carPhotoUpload = event.target.files[0];
      const reader = new FileReader();
      reader.onload = (e) => {
        car_photo_preview.value = e.target.result;
      };

      if (!event.target.files[0]) {
        car_photo_preview.value = null;
        return;
      }

      reader.readAsDataURL(event.target.files[0]);
    };

    const handleOwnerPhotoChange = (event) => {
      storiesForm.value.ownerPhotoUpload = event.target.files[0];
      const reader = new FileReader();
      reader.onload = (e) => {
        owner_photo_preview.value = e.target.result;
      };

      if (!event.target.files[0]) {
        owner_photo_preview.value = null;
        return;
      }

      reader.readAsDataURL(event.target.files[0]);
    };

    const handleOwnerPhoto2Change = (event) => {
      storiesForm.value.ownerPhoto2Upload = event.target.files[0];
      const reader = new FileReader();
      reader.onload = (e) => {
        owner_photo2_preview.value = e.target.result;
      };

      if (!event.target.files[0]) {
        owner_photo2_preview.value = null;
        return;
      }

      reader.readAsDataURL(event.target.files[0]);
    };

    const scrollTo = (elementID) => {
      let targetDiv = document.getElementById(elementID);
      if (targetDiv) {
        targetDiv.scrollIntoView({ behavior: "smooth" });
        menuVisible.value = false;
      }
    };

    const cleanupClonedElements = () => {
      const childrenPC1 = document.querySelectorAll(".story-pc1");
      const childrenPC2 = document.querySelectorAll(".story-pc2");
      const childrenPC3 = document.querySelectorAll(".story-pc3");
      const childrenPC4 = document.querySelectorAll(".story-pc4");
      const childrenMobile1 = document.querySelectorAll(
        ".story-mobile1 .marquee.cloned"
      );
      const childrenMobile2 = document.querySelectorAll(
        ".story-mobile2 .marquee.cloned"
      );
      if (childrenPC1.length > 10) {
        for (let i = 10; i < childrenPC1.length; i++) {
          childrenPC1[i].remove();
        }
      }

      if (childrenPC2.length > 10) {
        for (let i = 10; i < childrenPC2.length; i++) {
          childrenPC2[i].remove();
        }
      }

      if (childrenPC3.length > 10) {
        for (let i = 10; i < childrenPC3.length; i++) {
          childrenPC3[i].remove();
        }
      }

      if (childrenPC4.length > 10) {
        for (let i = 10; i < childrenPC4.length; i++) {
          childrenPC4[i].remove();
        }
      }

      if (childrenMobile1.length > 2) {
        for (let i = 2; i < childrenMobile1.length; i++) {
          childrenMobile1[i].remove();
        }
      }

      if (childrenMobile2.length > 2) {
        for (let i = 2; i < childrenMobile2.length; i++) {
          childrenMobile2[i].remove();
        }
      }
    };

    onBeforeUnmount(() => {
      if (cleanupInterval) {
        clearInterval(cleanupInterval);
      }
    });

    watch(menuVisible, (newValue) => {
      if (newValue) {
        document.body.classList.add("no-scroll");
      } else {
        document.body.classList.remove("no-scroll");
      }
    });

    onMounted(() => {
      window.onload = function () {
        animateNum();

        const modal = document.getElementById("contentModal");

        // 定義一個函數來停止YouTube影片
        function stopVideo() {
          const iframe = modal.querySelector("iframe");
          contentModalYTOpened.value = false;
          if (iframe) {
            const src = iframe.getAttribute("src");
            iframe.setAttribute("src", "");
            iframe.setAttribute("src", src);
          }
        }

        // 監聽modal關閉事件
        // 注意: 這裡的事件名稱可能需要根據你使用的modal庫來調整
        modal.addEventListener("hidden.bs.modal", stopVideo);
      };

      getStories();

      // detect is safari or not
      const isSafari = /^((?!chrome|android).)*safari/i.test(
        navigator.userAgent
      );
      if (isSafari || true) {
        //temporary
        setTimeout(() => {
          randomSpeedMobileLeft.value += Math.random() > 0.5 ? 1 : -1;
          randomSpeedMobileRight.value += Math.random() > 0.5 ? 1 : -1;
          randomSpeedPCLeft1.value += Math.random() > 0.5 ? 1 : -1;
          randomSpeedPCLeft2.value += Math.random() > 0.5 ? 1 : -1;
          randomSpeedPCRight1.value += Math.random() > 0.5 ? 1 : -1;
          randomSpeedPCRight2.value += Math.random() > 0.5 ? 1 : -1;
        }, 1500);
      }

      //detect is 991px or not
      const is991 = window.matchMedia("(max-width: 991px)");
      runMobileMarquee.value = is991.matches;
      if (runMobileMarquee.value) {
        cleanupInterval = setInterval(cleanupClonedElements, 2500); // 每5秒清理一次
      } else {
        cleanupInterval = setInterval(cleanupClonedElements, 5000); // 每5秒清理一次
      }

      const scrollContainer = document.querySelector(".story_share_container");

      let isDown = false;
      let startX;
      let scrollLeft;

      scrollContainer.addEventListener("mousedown", (e) => {
        isDown = true;
        scrollContainer.classList.add("active");
        startX = e.pageX - scrollContainer.offsetLeft;
        scrollLeft = scrollContainer.scrollLeft;
      });

      scrollContainer.addEventListener("mouseleave", () => {
        isDown = false;
        scrollContainer.classList.remove("active");
      });

      scrollContainer.addEventListener("mouseup", () => {
        isDown = false;
        scrollContainer.classList.remove("active");
      });

      scrollContainer.addEventListener("mousemove", (e) => {
        if (!isDown) return;
        e.preventDefault();
        const x = e.pageX - scrollContainer.offsetLeft;
        const walk = (x - startX) * 2; //scroll-fast
        scrollContainer.scrollLeft = scrollLeft - walk;
      });

      // 為 story_wall_pc 的箭頭添加點擊事件
      const storyWallUpArrow = document.querySelector(
        "#story_wall_pc .arrow_up"
      );
      const storyWallDownArrow = document.querySelector(
        "#story_wall_pc .arrow_down"
      );
      const storyWall = document.querySelector("#story_wall_pc");
      const storyWallMobile = document.querySelector("#story_wall_mobile");
      const storyWallMobileUpArrow = document.querySelector(
        "#story_wall_mobile .arrow_up"
      );
      const storyWallMobileArrow = document.querySelector(
        "#story_wall_mobile .arrow_down"
      );

      if (storyWallUpArrow) {
        storyWallUpArrow.addEventListener("click", () => {
          console.log(123);
          if (storyWall) {
            storyWall.scrollBy({
              top: -100,
              behavior: "smooth",
            });
          }
        });
      }

      if (storyWallMobileUpArrow) {
        storyWallMobileUpArrow.addEventListener("click", () => {
          if (storyWallMobile) {
            storyWallMobile.scrollBy({
              top: -100,
              behavior: "smooth",
            });
          }
        });
      }

      if (storyWallDownArrow) {
        storyWallDownArrow.addEventListener("click", () => {
          if (storyWall) {
            storyWall.scrollBy({
              top: 100,
              behavior: "smooth",
            });
          }
        });
      }

      if (storyWallMobileArrow) {
        storyWallMobileArrow.addEventListener("click", () => {
          if (storyWallMobile) {
            storyWallMobile.scrollBy({
              top: 100,
              behavior: "smooth",
            });
          }
        });
      }
    });

    return {
      animatedNumber,
      stories,
      storiesMobile,
      runMobileMarquee,
      contentModalData,
      contentModalSetData,
      contentModalYTOpened,
      storyModalData,
      storyModalSetData,
      storiesForm,
      submitStory,
      formErros,
      checkPolicy,
      triggerOwnerPhotoUpload,
      triggerOwnerPhoto2Upload,
      triggerCarPhotoUpload,
      car_photo,
      owner_photo,
      owner_photo2,
      handleCarPhotoChange,
      handleOwnerPhotoChange,
      handleOwnerPhoto2Change,
      owner_photo_preview,
      owner_photo2_preview,
      car_photo_preview,
      randomSpeedMobileLeft,
      randomSpeedMobileRight,
      randomSpeedPCLeft1,
      randomSpeedPCLeft2,
      randomSpeedPCRight1,
      randomSpeedPCRight2,
      scrollTo,
      toggleMenu,
      menuVisible,
    };
  },
};
</script>
<template>
  <main>
    <div class="menuMask" v-if="menuVisible"></div>
    <section id="banner_pc" ref="banner_pc">
      <div class="container">
        <div class="logo col-12">
          <img src="/assets/img/banner_logo.webp" loading="lazy" alt="logo" />
        </div>
        <div class="car col-12">
          <span class="animatedNumber">{{ animatedNumber }}</span>
          <img src="/assets/img/banner_car.webp" loading="lazy" alt="logo" />
        </div>
      </div>
    </section>
    <section id="banner_mobile" ref="banner_mobile">
      <div class="container">
        <div>
          <div class="nav-btn" @click="toggleMenu">
            <img src="/assets/img/nav_btn.webp" />
          </div>

          <div
            :class="menuVisible ? 'show' : ''"
            class="offcanvas offcanvas-end"
            tabindex="-1"
            style="visibility: visible"
          >
            <div class="offcanvas-header">
              <h5 class="offcanvas-title">Menu</h5>
              <button
                type="button"
                class="btn-close"
                @click="toggleMenu"
              ></button>
            </div>
            <div class="offcanvas-body">
              <div class="menu-list" @click="scrollTo('page_intro_mobile')">
                故事募集中
              </div>
              <div class="menu-list" @click="scrollTo('story_carousel_mobile')">
                幸福故事集
              </div>
              <div class="menu-list" @click="scrollTo('story_share_mobile')">
                Youtube體驗分享
              </div>
            </div>
          </div>
        </div>

        <div class="logo col-12">
          <img
            src="/assets/img/banner_logo_mobile.webp"
            loading="lazy"
            alt="logo"
          />
        </div>
        <div class="car col-12">
          <img src="/assets/img/banner_car.webp" loading="lazy" alt="logo" />
        </div>
        <div class="col-12">
          <span class="animatedNumber">{{ animatedNumber }}</span>
        </div>
      </div>
    </section>
    <section id="story_share_pc" ref="story_share_pc">
      <p class="text-center"><img src="/assets/img/wall_title.webp" /></p>
      <div class="story_share_container">
        <div class="story_share_row">
          <div class="story_share_col">
            <a
              href="https://www.youtube.com/watch?v=_XZr4BwKsXE"
              class="d-inline-block"
              target="_blank"
            >
              <img src="/assets/img/kol_01.webp" loading="lazy" alt="..." />
            </a>
            <p class="story_share_title">
              <a
                href="https://www.youtube.com/watch?v=_XZr4BwKsXE"
                target="_blank"
                >彰化 陳先生</a
              >
            </p>
            <p class="story_share_content">
              家人們的笑容就是最大的肯定！CUSTIN 的電動側滑門讓孩子能安全地上下車，第二排座椅還有通風加熱、電動腿托，爸媽都覺得坐起來很有 VIP 的感覺。這台車真的是照顧家庭的最佳選擇！
              <span
                ><a
                  href="https://www.youtube.com/watch?v=_XZr4BwKsXE"
                  target="_blank"
                  >[More]</a
                ></span
              >
            </p>
          </div>

          <div class="story_share_col">
            <a
              href="https://www.youtube.com/watch?v=qzXCEP3CBTk"
              class="d-inline-block"
              target="_blank"
            >
              <img src="/assets/img/kol_02.webp" loading="lazy" alt="..." />
            </a>
            <p class="story_share_title">
              <a
                href="https://www.youtube.com/watch?v=qzXCEP3CBTk"
                target="_blank"
                >新竹 黃小姐</a
              >
            </p>
            <p class="story_share_content">
              CUSTIN 的配備都是進口車才有的，像是第二排通風加熱座椅、雙側電動滑門、第三排通話功能。倒車時有環景影像、防撞輔助，女生開這台大車也倍感安心，真的是7人座首選！
              <span
                ><a
                  href="https://www.youtube.com/watch?v=qzXCEP3CBTk"
                  target="_blank"
                  >[More]</a
                ></span
              >
            </p>
          </div>

        </div>
      </div>
    </section>
    <section id="story_share_mobile" ref="story_share_mobile">
      <p class="text-center" id="story_share_mobile_title">
        <img src="/assets/img/wall_title_mobile.webp" loading="lazy" />
      </p>
      <div class="story_share_container">
        <div class="story_share_row">
          <div class="story_share_col">
            <a
              href="https://www.youtube.com/watch?v=_XZr4BwKsXE"
              class="d-inline-block"
              target="_blank"
            >
              <img src="/assets/img/kol_01.webp" loading="lazy" alt="..." />
            </a>
            <p class="story_share_title">
              <a
                href="https://www.youtube.com/watch?v=_XZr4BwKsXE"
                target="_blank"
                >彰化 陳先生</a
              >
            </p>
            <p class="story_share_content">
              家人們的笑容就是最大的肯定！CUSTIN 的電動側滑門讓孩子能安全地上下車，第二排座椅還有通風加熱、電動腿托，爸媽都覺得坐起來很有 VIP 的感覺。這台車真的是照顧家庭的最佳選擇！
              <span
                ><a
                  href="https://www.youtube.com/watch?v=_XZr4BwKsXE"
                  target="_blank"
                  >[More]</a
                ></span
              >
            </p>
          </div>

          <div class="story_share_col">
            <a
              href="https://www.youtube.com/watch?v=qzXCEP3CBTk"
              class="d-inline-block"
              target="_blank"
            >
              <img src="/assets/img/kol_02.webp" loading="lazy" alt="..." />
            </a>
            <p class="story_share_title">
              <a
                href="https://www.youtube.com/watch?v=qzXCEP3CBTk"
                target="_blank"
                >新竹 黃小姐</a
              >
            </p>
            <p class="story_share_content">
              CUSTIN 的配備都是進口車才有的，像是第二排通風加熱座椅、雙側電動滑門、第三排通話功能。倒車時有環景影像、防撞輔助，女生開這台大車也倍感安心，真的是7人座首選！
              <span
                ><a
                  href="https://www.youtube.com/watch?v=qzXCEP3CBTk"
                  target="_blank"
                  >[More]</a
                ></span
              >
            </p>
          </div>
        </div>
      </div>
    </section>

    <section id="page_intro_pc" class="d-none" ref="page_intro_pc">
      <div class="page-content">
        <div class="row d-none">
          <div class="col-12 text-center">
            <div class="link" @click="scrollTo('page_intro_pc')">
              故事募集中
            </div>
            <div class="link" @click="scrollTo('story_carousel_pc')">
              幸福故事集
            </div>
            <div class="link" @click="scrollTo('story_share_pc')">
              YouTuber體驗分享
            </div>
          </div>
        </div>
      </div>
      <div
        class="text-center post_btn d-none"
        data-bs-toggle="modal"
        data-bs-target="#postModal"
      >
        <img src="/assets/img/post_btn.webp" loading="lazy" alt="enter" />
      </div>
    </section>
    <section
      id="page_intro_mobile"
      ref="page_intro_mobile"
      class="text-center post_btn d-none"
      data-bs-toggle="modal"
      data-bs-target="#postModal"
    >
      <div class="container"></div>
    </section>

    <section id="story_carousel_pc" ref="story_carousel_pc">
      <div id="story_carousel_pc_shadow"></div>
      <div class="container">
        <div class="row">
          <div class="col-12">
            <div id="story_carousel_title">
              <img
                src="/assets/img/story_title.webp"
                loading="lazy"
                alt="title"
              />
            </div>
            <div
              id="story_carousel"
              class="carousel slide"
              data-ride="carousel"
            >
              <div class="carousel-inner">
                <div class="carousel-item active">
                  <div class="row">
                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '平鎮 林先生｜七人座首選配備超齊全',
                          `<img src='/assets/img/story/j/1.webp' loading='lazy' class='story-img' alt='...'/><br>我們家三代同堂，平常出門都要開兩台車，真的很不方便。所以開始考慮七人座MPV，最在意的就是電動滑門和安全功能，尤其是家裡有長輩跟小孩，乘車的安全性一定不能妥協。<br> <br>  當初會選擇CUSTIN，是因為在同級距的七人座裡，它的配備最齊全、價格又合理。我也看過ZINGER，不過功能跟配備上還是差了一截，尤其CUSTIN有滑門，這點就直接加分不少。加上現代汽車是全球前三大車廠，品牌讓人覺得信得過。<br>
        <img src='/assets/img/story/j/2.webp' loading='lazy' class='story-img' alt='...'/><br>
      實際開起來，除了外型大器之外，整體的舒適性、穩定性、安全感都讓人很安心。父母坐在第二排，也覺得車子安靜、座椅包覆性很好，舒適度很高。小孩平常坐第三排，因為有三角窗，可以看到外面景色，都會興奮地跟我們分享看到什麼。而且他們很喜歡滑門，每次都很期待想自己操作開關門，雖然平常還是由我來控制比較安全（笑）。<br><br>
      我們常開CUSTIN去郊外、景點走走，最遠目前開到中部，未來也想挑戰花蓮、台東等更遠的地方。因為輔助駕駛系統幫了我不少忙，長途駕駛不會太累，可以安排更多地方和家人一起探索，也讓我可以更專注在家人身上。<br><br>
      <img src='/assets/img/story/j/3.webp' loading='lazy' class='story-img' alt='...'/><br>  
      印象最深的一次，是加入CUSTIN車友社團之後，發現有滿多家庭車主會分享自己的用車心得，感覺很溫馨。這台車除了自己家用，有時候親友聚會如果臨時要載人，也可以派上用場，實用又有面子。<br><br>
      如果要推薦給朋友，我會說，CUSTIN的車身尺寸很剛好，台灣道路開起來不會有壓力，實用性真的很高。如果你也在找一台全家都會滿意的七人座車，那我只想說一句話：<br><br>👉「就快點入手吧，一起當車友吧！」<br>
              <img src='/assets/img/story/j/4.webp' loading='lazy' class='story-img' alt='...'/>
      `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/j/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            平鎮 林先生｜七人座首選配備超齊全
                          </h5>
                          <p class="story-content">
                            我們家三代同堂，平常出門都要開兩台車，真的很不方便。所以開始考慮七人座MPV，最在意的就是電動滑門和安全功能，尤其是...
                          </p>
                        </div>
                      </div>
                    </div>

                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '淡水 周先生｜幸福就來自車的舒適',
                          `<img src='/assets/img/story/k/1.webp' loading='lazy' class='story-img' alt='...'/><br>我們家人口比較多，原本開的是五加二的車，但第三排空間真的太擠，尤其有長輩或小孩一起搭車的時候，坐起來都不太舒服。加上我們每一兩個月就會開長途回高雄，久了真的覺得需要一台空間大、坐起來舒服的車，才不會每次旅程都像在忍耐。<br><br>
                          後來注意到CUSTIN，是因為空間配置真的很不錯，車長不到五米但室內空間很大，加上是七人座，實際上比之前的五加二舒適很多。而且有電動滑門，家中有小孩和長輩的話，上下車真的方便也安全很多。而且購車時業務介紹得非常清楚，不會有壓力，整個購車過程也讓人覺得舒服，這點也讓我們對這台車留下很好的第一印象。<br><br>
                          <img src='/assets/img/story/k/2.webp' loading='lazy' class='story-img' alt='...'/><br>  
                          開起來的感覺也讓我滿驚訝的，這台車雖然空間大，但靈活度、穩定性都很好，高速上也不會覺得車身笨重，馬力也夠，整體開起來是舒服、安心的。爸媽最有感，他們坐第二排都說可以整個躺平，長途坐下來也不會再腰痠腳麻了。<br>
                          <img src='/assets/img/story/k/3.webp' loading='lazy' class='story-img' alt='...'/><br>  
                          小朋友的話則超愛天窗，尤其是下雨天，看著雨滴打在玻璃上，對他們來說特別新鮮。現在只要是長途行程，他們都會自動帶上棉被，一上車就當自己的「移動小臥室」，常常一開沒多久就睡著了。<br><br>
                          有了CUSTIN之後，我們反而更願意安排一些長途旅程，像是開車去露營、小旅行之類的活動變多了。看著家人坐得舒服、心情也好，對我來說就是一件很值得的事。CUSTIN除了空間寬敞、舒適度高之外，整體駕駛體驗也很順手。<br>

                          <strong>一句話推薦 CUSTIN？</strong><br><br>
                          我會說：「家人的幸福感，就來自車的舒適感。」<br>
                          <img src='/assets/img/story/k/4.webp' loading='lazy' class='story-img' alt='...'/>
                          `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/k/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />  
                        <div class="story-body">
                          <h5 class="story-title">
                            淡水 周先生｜幸福就來自車的舒適
                          </h5>
                          <p class="story-content">
                            我們家人口比較多，原本開的是五加二的車，但第三排空間真的太擠，尤其有長輩或小孩一起搭車的時候，坐起來都不太舒服。加上我們每一兩個月...
                          </p>
                        </div>
                      </div>
                    </div>

                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '新豐 楊先生｜給全家人最高規格享受',
                          `<img src='/assets/img/story/l/1.webp' loading='lazy' class='story-img' alt='...'/><br>雖然我們家平常只有三口人，但因為常常要接送爸媽、全家出遊，換車時我就直接鎖定七人座。挑車的時候最重視的，其實就是乘坐舒適度，畢竟爸媽年紀大了，坐起來要舒服、進出也不能太費力，CUSTIN 的中間走道可以直通第三排，不用翻折座椅，爸媽上下車就很方便，非常適合家庭用。<br><br>
                          <img src='/assets/img/story/l/2.webp' loading='lazy' class='story-img' alt='...'/><br>  
                          而除了舒適性，自動滑門和跟車巡航，也是我覺得非常加分的功能。像很多停車場位子都很小，以前每次開傳統車門都擔心會撞到別人，現在有滑門完全不怕。而跟車系統更是讓我們全家出遠門的時候，安全又省心，大大減輕疲勞，尤其遇到塞車時，有這個功能真的差很多，這台車的完整度非常高。當初也有去看三菱、KIA、Mazda CX-9，但不是空間不夠，就是價格偏高或稅金不理想，整體比較下來，CUSTIN 真的是同級車中最讓我放心的選擇。<br><br>
                          爸媽對這台車的評價非常高。他們一坐上來就說：「這椅子比沙發還舒服。」以前長途開車常常坐到腰痠背痛，現在就算是連續幾小時的車程，也都能自在地聊天、欣賞風景，不再腰酸背痛。<br><br>
                          <img src='/assets/img/story/l/3.webp' loading='lazy' class='story-img' alt='...'/><br>  
                          孩子也愛上這台車。自動滑門讓她可以輕鬆上下車，車子的高級感及滑門，讓女兒覺得自己像公主。她最喜歡的是大螢幕跟音響，每次出門都要點歌當DJ，享受音樂，讓我這個爸爸看了都忍不住微笑。<br><br>
                          印象最深的一次，是剛牽車沒幾天，公司有重要客戶來訪，中午需要派車接送。因為剛好是七人，我就自告奮勇出動CUSTIN。沒想到客戶一上車就連連誇讚，坐起舒服，氣氛一下子就拉近了，也讓我感到很開心。<br><br>
                          對我們家來說，CUSTIN 在駕駛的過程中擁有滿滿的幸福感，旁人也經常投以羨慕的眼光，絕對是台值得入手的好車！<br><br>
                          <img src='/assets/img/story/l/4.webp' loading='lazy' class='story-img' alt='...'/>
                          `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/l/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            新豐 楊先生｜給全家人最高規格享受
                          </h5>
                          <p class="story-content">
                            雖然我們家平常只有三口人，但因為常常要接送爸媽、全家出遊，換車時我就直接鎖定七人座。挑車的時候最重視的，其實就是乘坐舒適度，...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>

                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '八德 林先生｜全家出遊就是幸福模樣',
                          `<img src='/assets/img/story/h/1.webp' loading='lazy' class='story-img' alt='...'/><br>
      我們家原本是開五人座車，常常會出現座位不夠的情況，一家人要出遊的時候，媽媽常常去不了，總覺得有些遺憾。所以當我們開始考慮換車時，首要目標就是一台真正能「全家坐得下」的七人座。<br><br>

      選擇 CUSTIN，除了空間夠大、乘坐舒適外，更實際的理由是它的自動電動滑門與電動尾門設計，對家有長輩與小孩的我們來說，非常方便。像是提東西、拿東西時，不用再彎腰拉門，電動滑門一鍵開啟，省力又安全。前座也可以幫小孩控制滑門，孩子們背著書包、拿著便當準備上下車時，動線非常順暢。<br>
      <img src='/assets/img/story/h/2.webp' loading='lazy' class='story-img' alt='...'/><br><br>

      我本身是現代汽車的長期車主，這已經是我第三台 Hyundai。從 I30CW、柴油版現在的 CUSTIN，一路走來最信任的還是現代汽車的安全性與 CP 值。這次在選車時也有試駕其他品牌，像 Kia Carnival、Skoda Kodiaq，但 CUSTIN 的價格相對親民、整體配置又不馬虎，是我們最後決定的關鍵。<br><br>

      特別喜歡的是第二排的座椅，不僅寬敞舒適，還有通風功能，搭配前座也有通風座椅，坐起來非常舒服。而且車子底盤高度適中，長輩上下車不用太費力，這點媽媽也覺得貼心。<br>
      <img src='/assets/img/story/h/3.webp' loading='lazy' class='story-img' alt='...'/><br><br>

      孩子也對這台車印象很好。他們覺得車內空間大，可以自在移動，第三排的頭部高度也夠，不像以前坐其他的車會覺得壓迫。現在上下學接送，他們也很開心，會和同學分享家裡的車，有種尊榮感，特別是滑門打開時！<br><br>

      如果要推薦 CUSTIN，我會說這是一台很實在的七人座 MPV，空間、便利性、價格都兼顧。幸福的感覺，有時候就是能帶著家人一起自在出遊！<br><br>

      <strong>一句話推薦 CUSTIN？</strong><br>
      如果有點心動不如馬上行動，機會是留給準備好的人，不然就要繼續等待下去囉！
      <img src='/assets/img/story/h/4.webp' loading='lazy' class='story-img' alt='...'/>
      
      `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/h/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            八德 林先生｜全家出遊就是幸福模樣
                          </h5>
                          <p class="story-content">
                            我們家原本是開五人座車，常常會出現座位不夠的情況，一家人要出遊的時候，媽媽常常去不了，總覺得有些遺憾。所以當我們開始考慮...
                          </p>
                        </div>
                      </div>
                    </div>

                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '土城 莊先生｜滿足全家人的移動城堡',
                          `<img src='/assets/img/story/i/1.webp' loading='lazy' class='story-img' alt='...'/><br>
      我們是三代同堂的家庭，一台車要滿足長輩、小孩、我們夫妻的需求，空間夠大、後座要好坐，真的很重要。以前的休旅車開了快二十年，想換車時看了很多七人座 MPV，剛好看到 CUSTIN 有不少網路討論，就實際去了解。<br><br>

      第一眼吸引我的是外型設計，有設計感又不浮誇。實際入手後，爸媽覺得這台車的第二排電動座椅像商務艙一樣，座椅幾乎可以平躺，一上車就能休息。<br>
      還有像高鐵那樣的餐檯，放飲料、食物都很方便。再加上通風座椅，不管冬天夏天都坐得舒服，這些細節讓人感受到 CUSTIN 對乘坐體驗的重視。<br>
      <img src='/assets/img/story/i/2.webp' loading='lazy' class='story-img' alt='...'/><br><br>

      第三排大空間，三個大人坐也沒問題，不像其他車款會有壓迫感。那時也看過其他廠牌，有的沒有滑門，第三排也比較擁擠。CUSTIN 不只空間大，還有我很在意的電動滑門，可以掌控開關，讓後座乘客上下車更安全，避免危險。<br>
      孩子們最喜歡的也是這個電動門。每天接送上下學時，我幫他們打開車門，他們就能直接上車，覺得像高級接駁車一樣，孩子的同學都會用羨慕的眼神看著這台車，覺得高級車又來了，我心裡也會偷偷得意。<br>
      <img src='/assets/img/story/i/3.webp' loading='lazy' class='story-img' alt='...'/><br><br>

      我們家旅遊很頻繁，像是北海岸下午茶、宜蘭、桃園，或是每兩三個月回嘉義娘家。現在開 CUSTIN 上高速公路，因為有 LV2 輔助，長途開起來輕鬆很多，也比以前省油滿多的，動力也夠，連爬坡都輕輕鬆鬆。<br>
      印象最深的一次，是拿這台車當老婆的弟弟婚禮車。我們是前導車，滑門一開氣勢十足，很多人都在看，還有人問這是哪一台車。那時我車子剛打完蠟，整台白色的 CUSTIN 在路上特別亮眼，真的會讓人覺得很有面子。<br><br>

      如果你在找一台適合全家出遊、長輩也能舒服乘坐的七人座，我會推薦 CUSTIN，第二排尊榮座椅、電動滑門、第三排大空間，加上價格 CP 值都很高。<br><br>

      <strong>一句話推薦 CUSTIN？</strong><br>
      「值回票價，不用猶豫」，要不然我車借你開看看也行。<br>
      <img src='/assets/img/story/i/4.webp' loading='lazy' class='story-img' alt='...'/>`
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/i/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            土城 莊先生｜滿足全家人的移動城堡
                          </h5>
                          <p class="story-content">
                            我們是三代同堂的家庭，一台車要滿足長輩、小孩、我們夫妻的需求，空間夠大、後座要好坐，真的很重要。以前的休旅車開了快二十年...
                          </p>
                        </div>
                      </div>
                    </div>

                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '鶯歌 吳先生｜我上山下海的最佳旅伴',
                          `<p><img src='/assets/img/story/g/1.webp' loading='lazy' class='story-img' alt='...'/><br/>
                          會考慮換七人座，是因為露營裝備越來越多，原本的車不只空間不夠，馬力也吃力。有次車子送進新莊廠保修，剛好走進展間，第一次看到CUSTIN，就覺得外型很現代感。後來回廠幾次有再了解，配備、空間、價格都在能接受的範圍，就決定入手。</p>
                        <p>當時也有考慮其他品牌的皮卡，但價格偏高、配備也沒有比較好，就沒選那台。選七人座我最在意的就是空間、馬力、還有外觀不能太老氣。CUSTIN是 1.5T引擎、170匹馬力，連上武嶺都沒問題，重點是稅金又省，開起來夠力但不傷荷包。</p>

                        <p>
                        <img src='/assets/img/story/g/2.webp' loading='lazy' class='story-img' alt='...'/><br/>
                        以現在很多休旅車破百萬來說，CUSTIN的價格算很實在，配備齊、用料也不馬虎，整體舒適度我很滿意。休假時我幾乎都開它出遊，不是露營就是釣魚，花蓮、屏東、高雄跑透透，七天六夜那種也常有。最有感的就是空間真的夠大，載滿一車也不會擠。甚至去澎湖，我直接坐船把車運過去，島上到處跑，完全不怕舟車勞頓。
                        </p>


                        <p>
                        <img src='/assets/img/story/g/3.webp' loading='lazy' class='story-img' alt='...'/><br/>
                        剛拿到車那陣子，CUSTIN在路上還不多，有時停紅燈，會有人多看幾眼，心裡也會覺得：「嗯，這車真不錯。」不管是實用性還是外觀設計，都讓人有一點小小的得意。
                        </p>

                        <p>我也推薦給不少同事，大家都是上班族，有家庭後對空間跟舒適度都特別有感。CUSTIN價格合理、馬力夠、配備到位，是一台很平均又划算的選擇。
                        </p>

                        <p>
                          一句話推薦 CUSTIN？<br/>
                          <strong>「親民的價格、舒適性的大空間、極佳穩定性的操控，還在觀望什麼？快入手CUSTIN吧。」</strong>
                          <br/>
                          <img src='/assets/img/story/g/4.webp' loading='lazy' class='story-img' alt='...'/><br/>
                        </p>
                        `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/g/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            鶯歌 吳先生｜我上山下海的最佳旅伴
                          </h5>
                          <p class="story-content">
                            會考慮換七人座，是因為露營裝備越來越多，原本的車不只空間不夠，馬力也吃力。有次車子送進新莊廠保修，剛好走進展間，第一次看到CUSTIN...
                          </p>
                        </div>
                      </div>
                    </div>


                  </div>
                </div>
                <div class="carousel-item">
                  <div class="row">

                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '新店 謝先生｜全家人的移動小天地',
                          `<p><img src='/assets/img/story/f/1.webp' loading='lazy' class='story-img' alt='...'/><br/>
                              我們家有六個人，一直需要一台空間夠大的車。當初找車時想法很單純：外型好看、空間夠大、家人坐得舒服就好。雖然預算有限，但還是希望找一台自己開得順手、家人也開心的車。</p>
                            <p>試過幾台七人座，有的底盤太高，開起來不穩，車內也會晃。後來試到 CUSTIN，真的有驚喜。油門、功能使用都很順，還有個我很喜歡的小細節：排檔做成按鈕式，底下多了收納空間，對於東西多的家庭超加分。</p>

                            <p>
                            <img src='/assets/img/story/f/2.webp' loading='lazy' class='story-img' alt='...'/><br/>
                            最讓我滿意的是第二排座椅的舒適度！爸媽坐得舒服、小孩也開心，我開起車來才安心。第二排有電動椅，椅背可以調整，空間寬敞，小孩可以自己走到第三排，不用翻椅子。還有獨立冷氣出風口，夏天不會悶熱，令人意外的也沒有刺鼻的新車味。
                            </p>
                            <p>我們平常做生意，能出門的機會不多，所以只要能放假，全家都會很期待。假日常去桃園、宜蘭走走，過年就回老家雲林。CUSTIN空間大、座椅舒服，長途也不會累。</p>
                            <p>印象最深的是交車那天，原本還怕年前拿不到，結果順利交車後，我馬上開去老家讓阿公阿嬤坐看看。他們一上車就說：「這台不錯耶！」鄰居也跑來看，問什麼車、多少錢，感覺超有面子。</p>


                            <p>
                            <img src='/assets/img/story/f/3.webp' loading='lazy' class='story-img' alt='...'/><br/>
                            現在最享受的就是假日出遊時光，放著音樂，一家人聊天笑鬧。有時也會跟老婆在車上來個簡單的兩人時光。這台車不只是交通工具，更像我們家的移動小天地，載著平凡日子裡的小幸福。
                            </p>

                            <p>
                              一句話推薦 CUSTIN？<br/>
                              <strong>「想顧好家人，又想自己開得爽，這台車不會讓你失望。」</strong>
                              <br/>
                              <img src='/assets/img/story/f/4.webp' loading='lazy' class='story-img' alt='...'/><br/>
                            </p>
                            `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/f/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            新店 謝先生｜全家人的移動小天地
                          </h5>
                          <p class="story-content">
                            我們家有六個人，一直需要一台空間夠大的車。當初找車時想法很單純：外型好看、空間夠大、家人坐得舒服就好。雖然預算有限，但還是希望...
                          </p>
                        </div>
                      </div>
                    </div>

                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '龍潭 吳先生｜照顧全家人的貼心夥伴',
                          `<img src='/assets/img/story/a/1.webp' loading='lazy' class='story-img' alt='...'/><br>我第一眼就被CUSTIN的顏值外觀給吸引，流線型的車身、大器的車頭霸氣設計以及尾燈也很醒目，都是目前流行的設計元素。整體給我的感覺就是很前衛有型。我也很喜歡它的駕駛座，直立的主機螢幕加上按鍵式排檔，使用上非常直覺便利。<br>
                            <img src='/assets/img/story/a/2.webp' loading='lazy' class='story-img' alt='...'/><br>
                          但內裝的部分才是讓我決定成為車主的最大原因，VIP皇家座椅第二排座椅、電動滑門、超大雙天窗，真的讓我出乎意料，CUSTIN通通都有，重點是第二排座椅竟然還有通風加熱功能，配備給的實在不手軟！<br>
                          <img src='/assets/img/story/a/3.webp' loading='lazy' class='story-img' alt='...'/><br>  
                          有時候如果要去露營或野餐，要載東西的時候，行李箱空間也很夠用，還有搭配電動尾門，簡直不要太方便。<br>
                            每次看到兩老坐在第二排舒服的享受，小朋友因為天窗打開看見天空而興奮歡呼，都讓我非常有成就感，CUSTIN就像是讓我的心聲一樣，準備很多高級貼心的功能，幫我把家人都照顧得好好的。`
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/a/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            龍潭 吳先生｜照顧全家人的貼心夥伴
                          </h5>
                          <p class="story-content">
                            我第一眼就被CUSTIN的顏值外觀給吸引，流線型的車身、大器的車頭霸氣設計以及尾燈也很醒目，都是目前流行的設計元素...
                          </p>
                        </div>
                      </div>
                    </div>

                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '和美 周先生 ｜配備給好給滿超有料',
                          `<img src='/assets/img/story/b/1.webp' class='story-img' loading='lazy' alt='...'/><br><p>我們家的兩個小朋友，最喜歡的就是CUSTIN的電動側滑門，因為剛換車的時候，我跟他們開了一個小玩笑，讓他們站在車門前大喊「魔法開開」，我在一旁偷偷用鑰匙遙控開啟，他們看著滑門慢慢滑開興奮得驚呼連連。</p>
                          <img src='/assets/img/story/b/2.webp' class='story-img' loading='lazy' alt='...'/>
                          <p>後來當然還是知道了這個咒語的秘密，但每當我們準備出發，小朋友們還是會興奮地跑到車前高喊「魔法開開」，然後看著車門自動打開，再開心地跳上車，我跟老婆都會心一笑。這個習慣成為了我們每次出遊前的小小儀式，這種互動不僅增加了樂趣，也讓孩子們更加期待每一次的旅行。</p>
                          <img src='/assets/img/story/b/3.webp' class='story-img' loading='lazy' alt='...'/>
                          <p>當然車子本身各方面的表現都很優秀，老婆也很喜歡，但我更滿意的是一家人在車上開開心心的樣子，CUSTIN和我們一起度過了很多美好時光。</p>`
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/b/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            和美 周先生 ｜配備給好給滿超有料
                          </h5>
                          <p class="story-content">
                            我們家的兩個小朋友，最喜歡的就是CUSTIN的電動側滑門，因為剛換車的時候，我跟他們開了一個小玩笑，讓他們站在車門前大喊...
                          </p>
                        </div>
                      </div>
                    </div>


                  </div>
                </div>

                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '永和 劉小姐｜寬敞空間輕鬆出遊',
                          `<img src='/assets/img/story/e/1.webp' class='story-img' loading='lazy' alt='...'/><br><p>我們家小朋友有在學跳舞，有一次在路上剛好聽到一首他們前陣子剛學過的音樂，他們很興奮的說這是上禮拜老師教的，然後他們就在後面直接跳起來～</p>
                          <img src='/assets/img/story/e/2.webp' class='story-img' loading='lazy' alt='...'/><br>
                          <p>CUSTIN的空間真的很大，每個位置都可以都坐得很舒服，有時候出去玩會帶多一些行李或其他東西，也都綽綽有餘，而且行李箱是電動尾門，上下東西很方便。</p>
                          <iframe width='100%' height='350' src='https://www.youtube.com/embed/0nNbDBBJ7vc?si=MRTpgpA3hCDYRZH-' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share' referrerpolicy='strict-origin-when-cross-origin' allowfullscreen></iframe>                     
                          <p>但更重要的是坐起來非常舒適，尤其是第二排的電動座椅，除了家人之外，有坐過的朋友或是同事也都讚譽有加！</p>
                          <p>而我自己因為最近天氣非常熱，對CUSTIN的通風坐椅就非常有感，我自己是比較怕熱的人，好險有這個功能，讓我就算開長途也能保持舒爽不悶熱，而且第一二排的位置都有，真的很貼心。</p>
                          <p>買到現在覺得CUSTIN不僅空間需求上可以滿足我，整體的舒適度跟質感表現也都在水準之上，而且還有很多貼心的設計跟配備，真的是一台非常超值的車！</p>
                          `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/e/1.webp"
                          loading="lazy"
                          class="story-img"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            永和 劉小姐｜寬敞空間輕鬆出遊
                          </h5>
                          <p class="story-content">
                            我們家小朋友有在學跳舞，有一次在路上剛好聽到一首他們前陣子剛學過的音樂，他們很興奮的說這是上禮拜教的，然後他們就在後面...
                          </p>
                        </div>
                      </div>
                    </div>

                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '楠梓 李先生 ｜體貼每一位的家庭神車',
                          `<img src='/assets/img/story/c/1.webp' class='story-img' loading='lazy' alt='...'/><br><p>當初是因為有空間上的需求，才開始找尋7人座的車，中間陸陸續續有看了很多款，還包含5+2的休旅車，但在都試乘過一遍後，只有CUSTIN在空間上能夠滿足我，而且也讓我印象最深刻！</p>
                          <img src='/assets/img/story/c/2.webp' class='story-img' loading='lazy' alt='...'/><br>
                          <p>當初試過後就被他的豐富配備給吸引，尤其是第二排座椅跟電動滑門，不敢相信在這個價位可以做到這樣。除此之外車內也有很多貼心的小細節，比如說第二排遮陽簾、折疊桌板，甚至還有杯架跟平板架，就像是在搭飛機一樣，就連第三排也有獨立的冷氣出風口跟USB充電孔，小朋友在後面也坐的很舒服。</p>
                          <img src='/assets/img/story/c/3.webp' class='story-img' loading='lazy' alt='...'/><br>
                          <p>開著CUSTIN載全家人出去後，大家對它的評價都非常高，覺得這是一台很舒適享受的車，每個位置都可以感受到CUSTIN有在用心替乘客著想，我自己也很高興可以買到一台讓全家人都滿意的車！</p>`
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/c/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            楠梓 李先生 ｜體貼每一位的家庭神車
                          </h5>
                          <p class="story-content">
                            當初是因為有空間上的需求，才開始找尋7人座的車，中間陸陸續續有看了很多款，還包含5+2的休旅車，但在都試乘過一遍後，只有CUSTIN...
                          </p>
                        </div>
                      </div>
                    </div>

                    <div
                      class="col-4 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '關西 許先生｜每一次旅程都無比享受',
                          `<img src='/assets/img/story/d/1.webp' class='story-img' loading='lazy' alt='...'/><br>
                          <p>我爸媽上了年紀後，行動變得沒那麼靈活，原本的車子對他們來說上下車不太方便，坐久了也會有身體痠痛的問題，因緣際會之下看到了CUSTIN，便帶著他們一起去看車。</p>
                          <img src='/assets/img/story/d/2.webp' class='story-img' loading='lazy' alt='...'/><br>
                          <p>看車當下，他們比較保守，一坐進去，雖然口頭上沒有說，但從他們放鬆的姿勢跟表情，我就能感受的出來他們的滿意，電動側滑門跟第二排座椅，完完全全就是我要的。</p>
                          <img src='/assets/img/story/d/3.webp' class='story-img' loading='lazy' alt='...'/><br>
                          <p>一開始其實會擔心車子比較大台，會不會不好開，因為我主要是上班通勤或接送家人，只有假日偶爾才會出去玩，大部分時間都是在市區跑。但實際開起來，我覺得整個視野很寬闊，而且A柱那邊還有一個三角窗，減少了很多死角，再加上有SVM環景功能，停車的時候也不用擔心不熟悉的環境，還有其他很多的安全輔助科技，給我滿滿的安全感。</p>
                          <p>老婆跟小孩也對這台車很喜歡，更讓我覺得開心的是，我爸媽以前總會嫌麻煩，現在變得比較願意出門了。</p>
                          
                          `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/d/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            關西 許先生｜每一次旅程都無比享受
                          </h5>
                          <p class="story-content">
                            我爸媽上了年紀後，行動變得沒那麼靈活，原本的車子對他們來說上下車不太方便，坐久了也會有身體痠痛的問題，因緣際會之下...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
              </div>
              <a
                class="carousel-control-prev"
                data-bs-target="#story_carousel"
                role="button"
                data-bs-slide="prev"
              >
                <img src="/assets/img/story_arrow_left.webp" />
              </a>
              <a
                class="carousel-control-next"
                data-bs-target="#story_carousel"
                role="button"
                data-bs-slide="next"
              >
                <img src="/assets/img/story_arrow_right.webp" />
              </a>
            </div>
          </div>
        </div>
      </div>
    </section>

    <section id="story_carousel_mobile" ref="story_carousel_mobile">
      <div class="container">
        <div class="row">
          <div class="col-12">
            <div id="story_carousel_title">
              <img
                src="/assets/img/story_title_mobile.webp"
                alt="title"
                loading="lazy"
              />
            </div>
            <div
              id="story_carousel_mobile_container"
              class="carousel slide"
              data-ride="carousel"
              data-touch="true"
            >
              <div class="carousel-inner">
                <div class="carousel-item active">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '平鎮 林先生｜七人座首選配備超齊全',
                          `<img src='/assets/img/story/j/1.webp' loading='lazy' class='story-img' alt='...'/><br>我們家三代同堂，平常出門都要開兩台車，真的很不方便。所以開始考慮七人座MPV，最在意的就是電動滑門和安全功能，尤其是家裡有長輩跟小孩，乘車的安全性一定不能妥協。<br> <br>  當初會選擇CUSTIN，是因為在同級距的七人座裡，它的配備最齊全、價格又合理。我也看過ZINGER，不過功能跟配備上還是差了一截，尤其CUSTIN有滑門，這點就直接加分不少。加上現代汽車是全球前三大車廠，品牌讓人覺得信得過。<br>
        <img src='/assets/img/story/j/2.webp' loading='lazy' class='story-img' alt='...'/><br>
      實際開起來，除了外型大器之外，整體的舒適性、穩定性、安全感都讓人很安心。父母坐在第二排，也覺得車子安靜、座椅包覆性很好，舒適度很高。小孩平常坐第三排，因為有三角窗，可以看到外面景色，都會興奮地跟我們分享看到什麼。而且他們很喜歡滑門，每次都很期待想自己操作開關門，雖然平常還是由我來控制比較安全（笑）。<br><br>
      我們常開CUSTIN去郊外、景點走走，最遠目前開到中部，未來也想挑戰花蓮、台東等更遠的地方。因為輔助駕駛系統幫了我不少忙，長途駕駛不會太累，可以安排更多地方和家人一起探索，也讓我可以更專注在家人身上。<br><br>
      <img src='/assets/img/story/j/3.webp' loading='lazy' class='story-img' alt='...'/><br>  
      印象最深的一次，是加入CUSTIN車友社團之後，發現有滿多家庭車主會分享自己的用車心得，感覺很溫馨。這台車除了自己家用，有時候親友聚會如果臨時要載人，也可以派上用場，實用又有面子。<br><br>
      如果要推薦給朋友，我會說，CUSTIN的車身尺寸很剛好，台灣道路開起來不會有壓力，實用性真的很高。如果你也在找一台全家都會滿意的七人座車，那我只想說一句話：<br><br>👉「就快點入手吧，一起當車友吧！」<br>
              <img src='/assets/img/story/j/4.webp' loading='lazy' class='story-img' alt='...'/>
      `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/j/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            平鎮 林先生｜七人座首選配備超齊全
                          </h5>
                          <p class="story-content">
                            我們家三代同堂，平常出門都要開兩台車，真的很不方便。所以開始考慮七人座MPV，最在意的就是電動滑門和安全功能，尤其是家裡有長輩跟小孩，乘車的安全性一定不能妥協。
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>


                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '淡水 周先生｜幸福就來自車的舒適',
                          `<img src='/assets/img/story/k/1.webp' loading='lazy' class='story-img' alt='...'/><br>我們家人口比較多，原本開的是五加二的車，但第三排空間真的太擠，尤其有長輩或小孩一起搭車的時候，坐起來都不太舒服。加上我們每一兩個月就會開長途回高雄，久了真的覺得需要一台空間大、坐起來舒服的車，才不會每次旅程都像在忍耐。<br><br>
                          後來注意到CUSTIN，是因為空間配置真的很不錯，車長不到五米但室內空間很大，加上是七人座，實際上比之前的五加二舒適很多。而且有電動滑門，家中有小孩和長輩的話，上下車真的方便也安全很多。而且購車時業務介紹得非常清楚，不會有壓力，整個購車過程也讓人覺得舒服，這點也讓我們對這台車留下很好的第一印象。<br><br>
                          <img src='/assets/img/story/k/2.webp' loading='lazy' class='story-img' alt='...'/><br>  
                          開起來的感覺也讓我滿驚訝的，這台車雖然空間大，但靈活度、穩定性都很好，高速上也不會覺得車身笨重，馬力也夠，整體開起來是舒服、安心的。爸媽最有感，他們坐第二排都說可以整個躺平，長途坐下來也不會再腰痠腳麻了。<br>
                          <img src='/assets/img/story/k/3.webp' loading='lazy' class='story-img' alt='...'/><br>  
                          小朋友的話則超愛天窗，尤其是下雨天，看著雨滴打在玻璃上，對他們來說特別新鮮。現在只要是長途行程，他們都會自動帶上棉被，一上車就當自己的「移動小臥室」，常常一開沒多久就睡著了。<br><br>
                          有了CUSTIN之後，我們反而更願意安排一些長途旅程，像是開車去露營、小旅行之類的活動變多了。看著家人坐得舒服、心情也好，對我來說就是一件很值得的事。CUSTIN除了空間寬敞、舒適度高之外，整體駕駛體驗也很順手。<br>

                          <strong>一句話推薦 CUSTIN？</strong><br><br>
                          我會說：「家人的幸福感，就來自車的舒適感。」<br>
                          <img src='/assets/img/story/k/4.webp' loading='lazy' class='story-img' alt='...'/>
                          `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/k/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            淡水 周先生｜幸福就來自車的舒適
                          </h5>
                          <p class="story-content">
                            我們家人口比較多，原本開的是五加二的車，但第三排空間真的太擠，尤其有長輩或小孩一起搭車的時候，坐起來都不太舒服。加上我們每一兩個月就會開長途回高雄...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '新豐 楊先生｜給全家人最高規格享受',
                          `<img src='/assets/img/story/l/1.webp' loading='lazy' class='story-img' alt='...'/><br>雖然我們家平常只有三口人，但因為常常要接送爸媽、全家出遊，換車時我就直接鎖定七人座。挑車的時候最重視的，其實就是乘坐舒適度，畢竟爸媽年紀大了，坐起來要舒服、進出也不能太費力，CUSTIN 的中間走道可以直通第三排，不用翻折座椅，爸媽上下車就很方便，非常適合家庭用。<br><br>
                          <img src='/assets/img/story/l/2.webp' loading='lazy' class='story-img' alt='...'/><br>  
                          而除了舒適性，自動滑門和跟車巡航，也是我覺得非常加分的功能。像很多停車場位子都很小，以前每次開傳統車門都擔心會撞到別人，現在有滑門完全不怕。而跟車系統更是讓我們全家出遠門的時候，安全又省心，大大減輕疲勞，尤其遇到塞車時，有這個功能真的差很多，這台車的完整度非常高。當初也有去看三菱、KIA、Mazda CX-9，但不是空間不夠，就是價格偏高或稅金不理想，整體比較下來，CUSTIN 真的是同級車中最讓我放心的選擇。<br><br>
                          爸媽對這台車的評價非常高。他們一坐上來就說：「這椅子比沙發還舒服。」以前長途開車常常坐到腰痠背痛，現在就算是連續幾小時的車程，也都能自在地聊天、欣賞風景，不再腰酸背痛。<br><br>
                          <img src='/assets/img/story/l/3.webp' loading='lazy' class='story-img' alt='...'/><br>  
                          孩子也愛上這台車。自動滑門讓她可以輕鬆上下車，車子的高級感及滑門，讓女兒覺得自己像公主。她最喜歡的是大螢幕跟音響，每次出門都要點歌當DJ，享受音樂，讓我這個爸爸看了都忍不住微笑。<br><br>
                          印象最深的一次，是剛牽車沒幾天，公司有重要客戶來訪，中午需要派車接送。因為剛好是七人，我就自告奮勇出動CUSTIN。沒想到客戶一上車就連連誇讚，坐起舒服，氣氛一下子就拉近了，也讓我感到很開心。<br><br>
                          對我們家來說，CUSTIN 在駕駛的過程中擁有滿滿的幸福感，旁人也經常投以羨慕的眼光，絕對是台值得入手的好車！<br><br>
                          <img src='/assets/img/story/l/4.webp' loading='lazy' class='story-img' alt='...'/>
                          `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/l/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            新豐 楊先生｜給全家人最高規格享受
                          </h5>
                          <p class="story-content">
                            雖然我們家平常只有三口人，但因為常常要接送爸媽、全家出遊，換車時我就直接鎖定七人座。挑車的時候最重視的，其實就是乘坐舒適度，畢竟爸媽年紀大了，坐起來要舒服、進出也不能太費力...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>

                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '八德 林先生｜全家出遊就是幸福模樣',
                          `<img src='/assets/img/story/h/1.webp' loading='lazy' class='story-img' alt='...'/><br>
      我們家原本是開五人座車，常常會出現座位不夠的情況，一家人要出遊的時候，媽媽常常去不了，總覺得有些遺憾。所以當我們開始考慮換車時，首要目標就是一台真正能「全家坐得下」的七人座。<br><br>

      選擇 CUSTIN，除了空間夠大、乘坐舒適外，更實際的理由是它的自動電動滑門與電動尾門設計，對家有長輩與小孩的我們來說，非常方便。像是提東西、拿東西時，不用再彎腰拉門，電動滑門一鍵開啟，省力又安全。前座也可以幫小孩控制滑門，孩子們背著書包、拿著便當準備上下車時，動線非常順暢。<br>
      <img src='/assets/img/story/h/2.webp' loading='lazy' class='story-img' alt='...'/><br><br>

      我本身是現代汽車的長期車主，這已經是我第三台 Hyundai。從 I30CW、柴油版現在的 CUSTIN，一路走來最信任的還是現代汽車的安全性與 CP 值。這次在選車時也有試駕其他品牌，像 Kia Carnival、Skoda Kodiaq，但 CUSTIN 的價格相對親民、整體配置又不馬虎，是我們最後決定的關鍵。<br><br>

      特別喜歡的是第二排的座椅，不僅寬敞舒適，還有通風功能，搭配前座也有通風座椅，坐起來非常舒服。而且車子底盤高度適中，長輩上下車不用太費力，這點媽媽也覺得貼心。<br>
      <img src='/assets/img/story/h/3.webp' loading='lazy' class='story-img' alt='...'/><br><br>

      孩子也對這台車印象很好。他們覺得車內空間大，可以自在移動，第三排的頭部高度也夠，不像以前坐其他的車會覺得壓迫。現在上下學接送，他們也很開心，會和同學分享家裡的車，有種尊榮感，特別是滑門打開時！<br><br>

      如果要推薦 CUSTIN，我會說這是一台很實在的七人座 MPV，空間、便利性、價格都兼顧。幸福的感覺，有時候就是能帶著家人一起自在出遊！<br><br>

      <strong>一句話推薦 CUSTIN？</strong><br>
      如果有點心動不如馬上行動，機會是留給準備好的人，不然就要繼續等待下去囉！
      <img src='/assets/img/story/h/4.webp' loading='lazy' class='story-img' alt='...'/>
      
      `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/h/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            八德 林先生｜全家出遊就是幸福模樣
                          </h5>
                          <p class="story-content">
                            我們家原本是開五人座車，常常會出現座位不夠的情況，一家人要出遊的時候，媽媽常常去不了，總覺得有些遺憾。所以當我們開始考慮換車時，首要目標就是一台真正能「全家坐得下」的七人座...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>

                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '土城 莊先生｜滿足全家人的移動城堡',
                          `<img src='/assets/img/story/i/1.webp' loading='lazy' class='story-img' alt='...'/><br>
      我們是三代同堂的家庭，一台車要滿足長輩、小孩、我們夫妻的需求，空間夠大、後座要好坐，真的很重要。以前的休旅車開了快二十年，想換車時看了很多七人座 MPV，剛好看到 CUSTIN 有不少網路討論，就實際去了解。<br><br>

      第一眼吸引我的是外型設計，有設計感又不浮誇。實際入手後，爸媽覺得這台車的第二排電動座椅像商務艙一樣，座椅幾乎可以平躺，一上車就能休息。<br>
      還有像高鐵那樣的餐檯，放飲料、食物都很方便。再加上通風座椅，不管冬天夏天都坐得舒服，這些細節讓人感受到 CUSTIN 對乘坐體驗的重視。<br>
      <img src='/assets/img/story/i/2.webp' loading='lazy' class='story-img' alt='...'/><br><br>

      第三排大空間，三個大人坐也沒問題，不像其他車款會有壓迫感。那時也看過其他廠牌，有的沒有滑門，第三排也比較擁擠。CUSTIN 不只空間大，還有我很在意的電動滑門，可以掌控開關，讓後座乘客上下車更安全，避免危險。<br>
      孩子們最喜歡的也是這個電動門。每天接送上下學時，我幫他們打開車門，他們就能直接上車，覺得像高級接駁車一樣，孩子的同學都會用羨慕的眼神看著這台車，覺得高級車又來了，我心裡也會偷偷得意。<br>
      <img src='/assets/img/story/i/3.webp' loading='lazy' class='story-img' alt='...'/><br><br>

      我們家旅遊很頻繁，像是北海岸下午茶、宜蘭、桃園，或是每兩三個月回嘉義娘家。現在開 CUSTIN 上高速公路，因為有 LV2 輔助，長途開起來輕鬆很多，也比以前省油滿多的，動力也夠，連爬坡都輕輕鬆鬆。<br>
      印象最深的一次，是拿這台車當老婆的弟弟婚禮車。我們是前導車，滑門一開氣勢十足，很多人都在看，還有人問這是哪一台車。那時我車子剛打完蠟，整台白色的 CUSTIN 在路上特別亮眼，真的會讓人覺得很有面子。<br><br>

      如果你在找一台適合全家出遊、長輩也能舒服乘坐的七人座，我會推薦 CUSTIN，第二排尊榮座椅、電動滑門、第三排大空間，加上價格 CP 值都很高。<br><br>

      <strong>一句話推薦 CUSTIN？</strong><br>
      「值回票價，不用猶豫」，要不然我車借你開看看也行。<br>
      <img src='/assets/img/story/i/4.webp' loading='lazy' class='story-img' alt='...'/>`
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/i/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            土城 莊先生｜滿足全家人的移動城堡
                          </h5>
                          <p class="story-content">
                            我們是三代同堂的家庭，一台車要滿足長輩、小孩、我們夫妻的需求，空間夠大、後座要好坐，真的很重要。以前的休旅車開了快二十年，想換車時看了很多七人座 MPV，剛好看到 CUSTIN...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>

                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '鶯歌 吳先生｜我上山下海的最佳旅伴',
                          `<p><img src='/assets/img/story/g/1.webp' loading='lazy' class='story-img' alt='...'/><br/>
                          會考慮換七人座，是因為露營裝備越來越多，原本的車不只空間不夠，馬力也吃力。有次車子送進新莊廠保修，剛好走進展間，第一次看到CUSTIN，就覺得外型很現代感。後來回廠幾次有再了解，配備、空間、價格都在能接受的範圍，就決定入手。</p>
                        <p>當時也有考慮其他品牌的皮卡，但價格偏高、配備也沒有比較好，就沒選那台。選七人座我最在意的就是空間、馬力、還有外觀不能太老氣。CUSTIN是 1.5T引擎、170匹馬力，連上武嶺都沒問題，重點是稅金又省，開起來夠力但不傷荷包。</p>

                        <p>
                        <img src='/assets/img/story/g/2.webp' loading='lazy' class='story-img' alt='...'/><br/>
                        以現在很多休旅車破百萬來說，CUSTIN的價格算很實在，配備齊、用料也不馬虎，整體舒適度我很滿意。休假時我幾乎都開它出遊，不是露營就是釣魚，花蓮、屏東、高雄跑透透，七天六夜那種也常有。最有感的就是空間真的夠大，載滿一車也不會擠。甚至去澎湖，我直接坐船把車運過去，島上到處跑，完全不怕舟車勞頓。
                        </p>


                        <p>
                        <img src='/assets/img/story/g/3.webp' loading='lazy' class='story-img' alt='...'/><br/>
                        剛拿到車那陣子，CUSTIN在路上還不多，有時停紅燈，會有人多看幾眼，心裡也會覺得：「嗯，這車真不錯。」不管是實用性還是外觀設計，都讓人有一點小小的得意。
                        </p>

                        <p>我也推薦給不少同事，大家都是上班族，有家庭後對空間跟舒適度都特別有感。CUSTIN價格合理、馬力夠、配備到位，是一台很平均又划算的選擇。
                        </p>

                        <p>
                          一句話推薦 CUSTIN？<br/>
                          <strong>「親民的價格、舒適性的大空間、極佳穩定性的操控，還在觀望什麼？快入手CUSTIN吧。」</strong>
                          <br/>
                          <img src='/assets/img/story/g/4.webp' loading='lazy' class='story-img' alt='...'/><br/>
                        </p>
                        `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/g/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            鶯歌 吳先生｜我上山下海的最佳旅伴
                          </h5>
                          <p class="story-content">
                            會考慮換七人座，是因為露營裝備越來越多，原本的車不只空間不夠，馬力也吃力。有次車子送進新莊廠保修，剛好走進展間，第一次看到CUSTIN，就覺得外型很現代感。後來回廠幾次有再了解...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>

                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '新店 謝先生｜全家人的移動小天地',
                          `<p><img src='/assets/img/story/f/1.webp' loading='lazy' class='story-img' alt='...'/><br/>
                              我們家有六個人，一直需要一台空間夠大的車。當初找車時想法很單純：外型好看、空間夠大、家人坐得舒服就好。雖然預算有限，但還是希望找一台自己開得順手、家人也開心的車。</p>
                            <p>試過幾台七人座，有的底盤太高，開起來不穩，車內也會晃。後來試到 CUSTIN，真的有驚喜。油門、功能使用都很順，還有個我很喜歡的小細節：排檔做成按鈕式，底下多了收納空間，對於東西多的家庭超加分。</p>

                            <p>
                            <img src='/assets/img/story/f/2.webp' loading='lazy' class='story-img' alt='...'/><br/>
                            最讓我滿意的是第二排座椅的舒適度！爸媽坐得舒服、小孩也開心，我開起車來才安心。第二排有電動椅，椅背可以調整，空間寬敞，小孩可以自己走到第三排，不用翻椅子。還有獨立冷氣出風口，夏天不會悶熱，令人意外的也沒有刺鼻的新車味。
                            </p>
                            <p>我們平常做生意，能出門的機會不多，所以只要能放假，全家都會很期待。假日常去桃園、宜蘭走走，過年就回老家雲林。CUSTIN空間大、座椅舒服，長途也不會累。</p>
                            <p>印象最深的是交車那天，原本還怕年前拿不到，結果順利交車後，我馬上開去老家讓阿公阿嬤坐看看。他們一上車就說：「這台不錯耶！」鄰居也跑來看，問什麼車、多少錢，感覺超有面子。</p>


                            <p>
                            <img src='/assets/img/story/f/3.webp' loading='lazy' class='story-img' alt='...'/><br/>
                            現在最享受的就是假日出遊時光，放著音樂，一家人聊天笑鬧。有時也會跟老婆在車上來個簡單的兩人時光。這台車不只是交通工具，更像我們家的移動小天地，載著平凡日子裡的小幸福。
                            </p>

                            <p>
                              一句話推薦 CUSTIN？<br/>
                              <strong>「想顧好家人，又想自己開得爽，這台車不會讓你失望。」</strong>
                              <br/>
                              <img src='/assets/img/story/f/4.webp' loading='lazy' class='story-img' alt='...'/><br/>
                            </p>
                            `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/f/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            新店 謝先生｜全家人的移動小天地
                          </h5>
                          <p class="story-content">
                            我們家有六個人，一直需要一台空間夠大的車。當初找車時想法很單純：外型好看、空間夠大、家人坐得舒服就好。雖然預算有限，但還是希望找一台自己開得順手、家人也開心的車。...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>

                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '龍潭吳先生｜照顧全家人的貼心夥伴',
                          `<img src='/assets/img/story/a/1.webp' loading='lazy' class='story-img' alt='...'/><br>我第一眼就被CUSTIN的顏值外觀給吸引，流線型的車身、大器的車頭霸氣設計以及尾燈也很醒目，都是目前流行的設計元素。整體給我的感覺就是很前衛有型。我也很喜歡它的駕駛座，直立的主機螢幕加上按鍵式排檔，使用上非常直覺便利。<br>
                            <img src='/assets/img/story/a/2.webp' loading='lazy' class='story-img' alt='...'/><br>
                          但內裝的部分才是讓我決定成為車主的最大原因，VIP皇家座椅第二排座椅、電動滑門、超大雙天窗，真的讓我出乎意料，CUSTIN通通都有，重點是第二排座椅竟然還有通風加熱功能，配備給的實在不手軟！<br>
                          <img src='/assets/img/story/a/3.webp' loading='lazy' class='story-img' alt='...'/><br>  
                          有時候如果要去露營或野餐，要載東西的時候，行李箱空間也很夠用，還有搭配電動尾門，簡直不要太方便。<br>
                            每次看到兩老坐在第二排舒服的享受，小朋友因為天窗打開看見天空而興奮歡呼，都讓我非常有成就感，CUSTIN就像是讓我的心聲一樣，準備很多高級貼心的功能，幫我把家人都照顧得好好的。`
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/a/1.webp"
                          loading="lazy"
                          class="story-img"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            龍潭 吳先生｜照顧全家人的貼心夥伴
                          </h5>
                          <p class="story-content">
                            我第一眼就被CUSTIN的顏值外觀給吸引，流線型的車身、大器的車頭霸氣設計以及尾燈也很醒目，都是目前流行的設計元素。整體給我的感覺就是很前衛有型。我也很喜歡它的駕駛座...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '和美 周先生 ｜配備給好給滿超有料',
                          `<img src='/assets/img/story/b/1.webp' loading='lazy' class='story-img' alt='...'/><br><p>我們家的兩個小朋友，最喜歡的就是CUSTIN的電動側滑門，因為剛換車的時候，我跟他們開了一個小玩笑，讓他們站在車門前大喊「魔法開開」，我在一旁偷偷用鑰匙遙控開啟，他們看著滑門慢慢滑開興奮得驚呼連連。</p>
                          <img src='/assets/img/story/b/2.webp' loading='lazy' class='story-img' alt='...'/>
                          <p>後來當然還是知道了這個咒語的秘密，但每當我們準備出發，小朋友們還是會興奮地跑到車前高喊「魔法開開」，然後看著車門自動打開，再開心地跳上車，我跟老婆都會心一笑。這個習慣成為了我們每次出遊前的小小儀式，這種互動不僅增加了樂趣，也讓孩子們更加期待每一次的旅行。</p>
                          <img src='/assets/img/story/b/3.webp' loading='lazy' class='story-img' alt='...'/>
                          <p>當然車子本身各方面的表現都很優秀，老婆也很喜歡，但我更滿意的是一家人在車上開開心心的樣子，CUSTIN和我們一起度過了很多美好時光。</p>`
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/b/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            和美 周先生 ｜配備給好給滿超有料
                          </h5>
                          <p class="story-content">
                            我們家的兩個小朋友，最喜歡的就是CUSTIN的電動側滑門，因為剛換車的時候，我跟他們開了一個小玩笑，讓他們站在車門前大喊「魔法開開」，我在一旁偷偷用鑰匙遙控開啟...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>

                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '楠梓 李先生 ｜體貼每一位的家庭神車',
                          `<img src='/assets/img/story/c/1.webp' loading='lazy' class='story-img' alt='...'/><br><p>當初是因為有空間上的需求，才開始找尋7人座的車，中間陸陸續續有看了很多款，還包含5+2的休旅車，但在都試乘過一遍後，只有CUSTIN在空間上能夠滿足我，而且也讓我印象最深刻！</p>
                          <img src='/assets/img/story/c/2.webp' loading='lazy' class='story-img' alt='...'/><br>
                          <p>當初試過後就被他的豐富配備給吸引，尤其是第二排座椅跟電動滑門，不敢相信在這個價位可以做到這樣。除此之外車內也有很多貼心的小細節，比如說第二排遮陽簾、折疊桌板，甚至還有杯架跟平板架，就像是在搭飛機一樣，就連第三排也有獨立的冷氣出風口跟USB充電孔，小朋友在後面也坐的很舒服。</p>
                          <img src='/assets/img/story/c/3.webp' loading='lazy' class='story-img' alt='...'/><br>
                          <p>開著CUSTIN載全家人出去後，大家對它的評價都非常高，覺得這是一台很舒適享受的車，每個位置都可以感受到CUSTIN有在用心替乘客著想，我自己也很高興可以買到一台讓全家人都滿意的車！</p>`
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/c/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            楠梓 李先生 ｜體貼每一位的家庭神車
                          </h5>
                          <p class="story-content">
                            當初是因為有空間上的需求，才開始找尋7人座的車，中間陸陸續續有看了很多款，還包含5+2的休旅車，但在都試乘過一遍後，只有CUSTIN在空間上能夠滿足我，而且也讓我印象最深刻！
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '關西 許先生｜每一次旅程都無比享受',
                          `<img src='/assets/img/story/d/1.webp' loading='lazy' class='story-img' alt='...'/><br>
                          <p>我爸媽上了年紀後，行動變得沒那麼靈活，原本的車子對他們來說上下車不太方便，坐久了也會有身體痠痛的問題，因緣際會之下看到了CUSTIN，便帶著他們一起去看車。</p>
                          <img src='/assets/img/story/d/2.webp' loading='lazy' class='story-img' alt='...'/><br>
                          <p>看車當下，他們比較保守，一坐進去，雖然口頭上沒有說，但從他們的放鬆的姿勢跟表情，我就能感受的出來他們的滿意，電動側滑門跟第二排座椅，完完全全就是我要的。</p>
                          <img src='/assets/img/story/d/3.webp' loading='lazy' class='story-img' alt='...'/><br>
                          <p>一開始其實會擔心車子比較大台，會不會不好開，因為我主要是上班通勤或接送家人，只有假日偶爾才會出去玩，大部分時間都是在市區跑。但實際開起來，我覺得整個視野很寬闊，而且A柱那邊還有一個三角窗，減少了很多死角，再加上有SVM環景功能，停車的時候也不用擔心不熟悉的環境，還有其他很多的安全輔助科技，給我滿滿的安全感。</p>
                          <p>老婆跟小孩也對這台車很喜歡，更讓我覺得開心的是，我爸媽以前總會嫌麻煩，現在變得比較願意出門了。</p>
                          
                          `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/d/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            關西 許先生｜每一次旅程都無比享受
                          </h5>
                          <p class="story-content">
                            我爸媽上了年紀後，行動變得沒那麼靈活，原本的車子對他們來說上下車不太方便，坐久了也會有身體痠痛的問題，因緣際會之下看到了CUSTIN，便帶著他們一起去看車...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
                <div class="carousel-item">
                  <div class="row">
                    <div
                      class="col-12 col-story"
                      data-bs-toggle="modal"
                      data-bs-target="#storyModal"
                      @click="
                        storyModalSetData(
                          '永和 劉小姐｜寬敞空間輕鬆出遊',
                          `<img src='/assets/img/story/e/1.webp' loading='lazy' class='story-img' alt='...'/><br><p>我們家小朋友有在學跳舞，有一次在路上剛好聽到一首他們前陣子剛學過的音樂，他們很興奮的說這是上禮拜老師教的，然後他們就在後面直接跳起來～</p>
                          <img src='/assets/img/story/e/2.webp' loading='lazy' class='story-img' alt='...'/><br>
                          <p>CUSTIN的空間真的很大，每個位置都可以都坐得很舒服，有時候出去玩會帶多一些行李或其他東西，也都綽綽有餘，而且行李箱是電動尾門，上下東西很方便。</p>
                          <iframe width='100%' height='250' src='https://www.youtube.com/embed/0nNbDBBJ7vc?si=MRTpgpA3hCDYRZH-' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share' referrerpolicy='strict-origin-when-cross-origin' allowfullscreen></iframe>                          <p>但更重要的是坐起來非常舒適，尤其是第二排的電動座椅，除了家人之外，有坐過的朋友或是同事也都讚譽有加！</p>
                          <p>而我自己因為最近天氣非常熱，對CUSTIN的通風坐椅就非常有感，我自己是比較怕熱的人，好險有這個功能，讓我就算開長途也能保持舒爽不悶熱，而且第一二排的位置都有，真的很貼心。</p>
                          <p>買到現在覺得CUSTIN不僅空間需求上可以滿足我，整體的舒適度跟質感表現也都在水準之上，而且還有很多貼心的設計跟配備，真的是一台非常超值的車！</p>
                          `
                        )
                      "
                    >
                      <div class="story">
                        <img
                          src="/assets/img/story/e/1.webp"
                          class="story-img"
                          loading="lazy"
                          alt="..."
                        />
                        <div class="story-body">
                          <h5 class="story-title">
                            永和 劉小姐｜寬敞空間輕鬆出遊
                          </h5>
                          <p class="story-content">
                            我們家小朋友有在學跳舞，有一次在路上剛好聽到一首他們前陣子剛學過的音樂，他們很興奮的說這是上禮拜老師教的，然後他們就在後面直接跳起來。CUSTIN的空間真的很大...
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
              </div>
              <div class="carousel-controls">
                <a
                  data-bs-target="#story_carousel_mobile_container"
                  role="button"
                  data-bs-slide="prev"
                >
                  <img src="/assets/img/story_arrow_left.webp" />
                </a>
                <a
                  data-bs-target="#story_carousel_mobile_container"
                  role="button"
                  data-bs-slide="next"
                >
                  <img src="/assets/img/story_arrow_right.webp" />
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </section>

    <section id="story_wall_pc" ref="story_wall_pc">
      <!-- <div class="arrow arrow_down"></div>
      <div class="arrow arrow_up"></div> -->
      <div class="row wall-row">
        <div class="col-6 story-wall left">
          <div class="row">
            <div class="col-6 story-wall-left left">
              <div class="row">
                <div class="col-12">
                  <Vue3Marquee
                    :vertical="true"
                    :pause-on-hover="true"
                    :clone="true"
                    :duration="randomSpeedPCLeft1"
                    v-if="!runMobileMarquee"
                  >
                    <div
                      class="story story-pc1"
                      v-for="(story, index) in stories[0]"
                      :key="index"
                      data-bs-toggle="modal"
                      data-bs-target="#contentModal"
                      @click="
                        contentModalSetData(
                          story.recommendation_title,
                          story.owner_photo,
                          story.recommendation_content,
                          story.social_media_link
                        )
                      "
                    >
                      <img
                        :src="story.owner_photo"
                        class="story-img"
                        :alt="story.recommendation_title"
                        loading="lazy"
                      />
                      <div class="story-body">
                        {{ story.recommendation_title }}
                      </div>
                    </div>
                  </Vue3Marquee>
                </div>
              </div>
            </div>
            <div class="col-6 story-wall-left right">
              <div class="row">
                <div class="col-12">
                  <Vue3Marquee
                    :vertical="true"
                    :pause-on-hover="true"
                    :clone="true"
                    :duration="randomSpeedPCLeft2"
                    v-if="!runMobileMarquee"
                  >
                    <div
                      class="story-pc2 story"
                      data-bs-toggle="modal"
                      data-bs-target="#contentModal"
                      @click="
                        contentModalSetData(
                          story.recommendation_title,
                          story.owner_photo,
                          story.recommendation_content,
                          story.social_media_link
                        )
                      "
                      v-for="(story, index) in stories[1]"
                      :key="index"
                    >
                      <img
                        :src="story.owner_photo"
                        class="story-img"
                        :alt="story.recommendation_title"
                        loading="lazy"
                      />
                      <div class="story-body">
                        {{ story.recommendation_title }}
                      </div>
                    </div>
                  </Vue3Marquee>
                </div>
              </div>
            </div>
          </div>
        </div>
        <div class="col-6 story-wall right">
          <div class="row">
            <div class="col-6 story-wall-left left">
              <div class="row">
                <div class="col-12">
                  <Vue3Marquee
                    :vertical="true"
                    :pause-on-hover="true"
                    :clone="true"
                    :duration="randomSpeedPCRight1"
                    v-if="!runMobileMarquee"
                  >
                    <div
                      class="story story-pc3"
                      data-bs-toggle="modal"
                      data-bs-target="#contentModal"
                      @click="
                        contentModalSetData(
                          story.recommendation_title,
                          story.owner_photo,
                          story.recommendation_content,
                          story.social_media_link
                        )
                      "
                      v-for="(story, index) in stories[2]"
                      :key="index"
                    >
                      <img
                        :src="story.owner_photo"
                        class="story-img"
                        loading="lazy"
                        :alt="story.recommendation_title"
                      />
                      <div class="story-body">
                        {{ story.recommendation_title }}
                      </div>
                    </div>
                  </Vue3Marquee>
                </div>
              </div>
            </div>
            <div class="col-6 story-wall-right right">
              <div class="row">
                <div class="col-12">
                  <Vue3Marquee
                    :vertical="true"
                    :pause-on-hover="true"
                    :clone="true"
                    :duration="randomSpeedPCRight2"
                    v-if="!runMobileMarquee"
                  >
                    <div
                      class="story story-pc4"
                      data-bs-toggle="modal"
                      data-bs-target="#contentModal"
                      @click="
                        contentModalSetData(
                          story.recommendation_title,
                          story.owner_photo,
                          story.recommendation_content,
                          story.social_media_link
                        )
                      "
                      v-for="(story, index) in stories[3]"
                      :key="index"
                    >
                      <img
                        :src="story.owner_photo"
                        class="story-img"
                        loading="lazy"
                        :alt="story.recommendation_title"
                      />
                      <div class="story-body">
                        {{ story.recommendation_title }}
                      </div>
                    </div>
                  </Vue3Marquee>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </section>

    <section id="story_wall_mobile" ref="story_wall_mobile">
      <!-- <div class="arrow arrow_down"></div>
      <div class="arrow arrow_up"></div> -->
      <div class="container">
        <div class="row">
          <div class="col-12 story-wall">
            <div class="row">
              <div class="col-6 story-wall-left left story-mobile1">
                <div class="row">
                  <div class="col-12">
                    <Vue3Marquee
                      :vertical="true"
                      :clone="true"
                      :duration="randomSpeedMobileLeft"
                      v-if="runMobileMarquee"
                    >
                      <div
                        class="story"
                        data-bs-toggle="modal"
                        data-bs-target="#contentModal"
                        @click="
                          contentModalSetData(
                            story.recommendation_title,
                            story.owner_photo,
                            story.recommendation_content,
                            story.social_media_link
                          )
                        "
                        v-for="(story, index) in storiesMobile[0]"
                        :key="index"
                      >
                        <img
                          :src="story.owner_photo"
                          class="story-img"
                          loading="lazy"
                          :alt="story.recommendation_title"
                        />
                        <div class="story-body">
                          {{ story.recommendation_title }}
                        </div>
                      </div>
                    </Vue3Marquee>
                  </div>
                </div>
              </div>
              <div class="col-6 story-wall-right right story-mobile2">
                <div class="row">
                  <div class="col-12">
                    <Vue3Marquee
                      :vertical="true"
                      :clone="true"
                      :duration="randomSpeedMobileRight"
                      v-if="runMobileMarquee"
                    >
                      <div
                        class="story"
                        data-bs-toggle="modal"
                        data-bs-target="#contentModal"
                        @click="
                          contentModalSetData(
                            story.recommendation_title,
                            story.owner_photo,
                            story.recommendation_content,
                            story.social_media_link
                          )
                        "
                        v-for="(story, index) in storiesMobile[1]"
                        :key="index"
                      >
                        <img
                          :src="story.owner_photo"
                          class="story-img"
                          loading="lazy"
                          :alt="story.recommendation_title"
                        />
                        <div class="story-body">
                          {{ story.recommendation_title }}
                        </div>
                      </div>
                    </Vue3Marquee>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </section>

    <div
      class="modal fade"
      id="storyModal"
      tabindex="-1"
      aria-labelledby="storyModalTitle"
      aria-hidden="true"
      style="display: none; background-color: rgb(173, 205, 221, 0.5)"
    >
      <div class="modal-dialog modal-lg">
        <div class="modal-content">
          <div class="modal-header">
            <h1 class="modal-title fs-5" id="contentModalTitle">
              <img src="/assets/img/tape.webp" loading="lazy" />
              {{ storyModalData.title }}
            </h1>
            <button
              type="button"
              class="btn-close"
              data-bs-dismiss="modal"
              aria-label="Close"
            ></button>
          </div>
          <div class="modal-body" v-html="storyModalData.content"></div>
        </div>
      </div>
    </div>
    <div
      class="modal fade"
      id="contentModal"
      tabindex="-1"
      aria-labelledby="contentModalTitle"
      aria-hidden="true"
      style="display: none; background-color: rgb(173, 205, 221, 0.5)"
    >
      <div class="modal-dialog modal-lg">
        <div class="modal-content">
          <div class="modal-header">
            <h1 class="modal-title fs-5" id="contentModalTitle">
              <img src="/assets/img/tape.webp" loading="lazy" />
              {{ contentModalData.title }}
            </h1>
            <button
              type="button"
              class="btn-close"
              data-bs-dismiss="modal"
              aria-label="Close"
            ></button>
          </div>
          <div class="modal-body">
            <div v-if="contentModalData.social_media_link != null">
              <a
                :href="contentModalData.social_media_link"
                target="_blank"
                v-if="!contentModalData.social_media_link.includes('youtube')"
              >
                <img
                  :src="contentModalData.img_url"
                  v-if="contentModalData.img_url != null"
                />
              </a>
              <div v-else>
                <img
                  :src="contentModalData.img_url"
                  @click="contentModalYTOpened = true"
                  v-if="!contentModalYTOpened"
                  role="button"
                />
                <iframe
                  v-if="contentModalYTOpened"
                  width="100%"
                  height="350"
                  :src="contentModalData.social_media_link"
                  title="YouTube video player"
                  frameborder="0"
                  allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
                  allowfullscreen
                ></iframe>
              </div>
            </div>

            <div v-else>
              <img
                :src="contentModalData.img_url"
                v-if="contentModalData.img_url != null"
              />
            </div>

            <p v-html="contentModalData.content"></p>
          </div>
        </div>
      </div>
    </div>
    <div
      class="modal fade"
      id="postModal"
      tabindex="-1"
      aria-labelledby="postModalTitle"
      aria-hidden="true"
      style="display: none; background-color: rgb(173, 205, 221, 0.5)"
    >
      <div class="modal-dialog modal-lg">
        <div class="modal-content">
          <div class="modal-header">
            <button
              type="button"
              class="btn-close"
              data-bs-dismiss="modal"
              aria-label="Close"
              id="closePostModal"
            ></button>
          </div>
          <div class="modal-body">
            <div class="container">
              <div class="row">
                <div class="col-12">
                  <div class="post_title">
                    <img
                      src="/assets/img/post_modal_title.webp"
                      loading="lazy"
                      alt="post"
                    />
                  </div>
                </div>
                <div class="col-12 col-lg-6 post-form">
                  <div class="form-group">
                    <label for="car_owner_name">車主(領牌者)姓名</label>
                    <input
                      type="text"
                      class="form-control"
                      :class="{ 'is-invalid': formErros.car_owner_name }"
                      id="car_owner_name"
                      placeholder="請填寫車主本人姓名"
                      v-model="storiesForm.car_owner_name"
                    />
                    <span
                      class="invalid-feedback"
                      v-if="formErros.car_owner_name"
                      v-html="formErros.car_owner_name"
                    ></span>
                  </div>
                  <div class="form-group">
                    <label for="contact_phone">車主聯絡電話</label>
                    <input
                      type="text"
                      class="form-control"
                      :class="{ 'is-invalid': formErros.contact_phone }"
                      id="contact_phone"
                      placeholder="請填寫車主聯絡電話"
                      v-model="storiesForm.contact_phone"
                    />
                    <span
                      class="invalid-feedback"
                      v-if="formErros.contact_phone"
                      v-html="formErros.contact_phone"
                    ></span>
                  </div>
                  <div class="form-group">
                    <label for="contact_email">車主聯絡E-Mail</label>
                    <input
                      type="email"
                      class="form-control"
                      :class="{ 'is-invalid': formErros.contact_email }"
                      id="contact_email"
                      placeholder="請填寫車主聯絡E-Mail"
                      v-model="storiesForm.contact_email"
                    />
                    <span
                      class="invalid-feedback"
                      v-if="formErros.contact_email"
                      v-html="formErros.contact_email"
                    ></span>
                  </div>
                  <div class="form-group">
                    <label for="license_plate">車牌號碼</label>
                    <input
                      type="text"
                      class="form-control"
                      :class="{ 'is-invalid': formErros.license_plate }"
                      id="license_plate"
                      v-model="storiesForm.license_plate"
                      placeholder="請填寫車牌號碼"
                    />
                    <span
                      class="invalid-feedback"
                      v-if="formErros.license_plate"
                      v-html="formErros.license_plate"
                    ></span>
                  </div>
                  <div class="form-group">
                    <label for="recommendation_title">故事標題</label>
                    <input
                      type="text"
                      class="form-control"
                      :class="{ 'is-invalid': formErros.recommendation_title }"
                      id="recommendation_title"
                      placeholder="請填寫故事標題"
                      v-model="storiesForm.recommendation_title"
                    />
                    <span
                      class="invalid-feedback"
                      v-if="formErros.recommendation_title"
                      v-html="formErros.recommendation_title"
                    ></span>
                  </div>
                  <div class="form-group">
                    <label for="recommendation_content"
                      >故事分享（上限300字）</label
                    >
                    <textarea
                      class="form-control"
                      id="recommendation_content"
                      :class="{
                        'is-invalid': formErros.recommendation_content,
                      }"
                      rows="6"
                      placeholder="請填寫您的故事"
                      v-model="storiesForm.recommendation_content"
                    ></textarea>
                    <div class="text-count">
                      <small
                        :class="{
                          'text-danger':
                            storiesForm.recommendation_content.length > 300,
                        }"
                      >
                        {{ storiesForm.recommendation_content.length }}/300
                      </small>
                    </div>
                    <span
                      class="invalid-feedback"
                      v-if="formErros.recommendation_content"
                      v-html="formErros.recommendation_content"
                    ></span>
                  </div>
                </div>
                <div class="col-12 col-lg-6 post-form">
                  <div class="form-group">
                    <img
                      class="step1_img"
                      src="/assets/img/step1.png"
                      loading="lazy"
                    />
                    <label id="car_photo_label" @click="triggerCarPhotoUpload"
                      >上傳愛車照片</label
                    >
                    <input
                      type="file"
                      class="form-control"
                      id="car_photo"
                      ref="car_photo"
                      :class="{ 'is-invalid': formErros.carPhotoUpload }"
                      accept="image/*"
                      @change="handleCarPhotoChange($event)"
                    />
                    <div v-if="car_photo_preview" class="image-preview mt-3">
                      <img
                        :src="car_photo_preview"
                        alt="預覽圖片"
                        class="img-fluid"
                        style="max-width: 150px"
                      />
                    </div>
                    <span
                      class="invalid-feedback"
                      v-if="formErros.carPhotoUpload"
                      v-html="formErros.carPhotoUpload"
                    ></span>
                  </div>
                  <div class="form-group mt-3">
                    <img
                      class="step2_img mb-2"
                      loading="lazy"
                      src="/assets/img/step2.png"
                    />
                    <p style="font-size: 18px; font-weight: 500">
                      上傳與CUSTIN的生活照或影片
                    </p>
                    <label
                      id="owner_photo_label"
                      @click="triggerOwnerPhotoUpload"
                      >上傳生活照1</label
                    >
                    <input
                      type="file"
                      class="form-control"
                      id="owner_photo"
                      ref="owner_photo"
                      :class="{ 'is-invalid': formErros.ownerPhotoUpload }"
                      accept="image/*"
                      @change="handleOwnerPhotoChange($event)"
                    />
                    <div v-if="owner_photo_preview" class="image-preview mt-3">
                      <img
                        :src="owner_photo_preview"
                        alt="預覽圖片"
                        class="img-fluid"
                        style="max-width: 150px"
                      />
                    </div>
                    <span
                      class="invalid-feedback"
                      v-if="formErros.ownerPhotoUpload"
                      v-html="formErros.ownerPhotoUpload"
                    ></span>
                  </div>
                  <div class="form-group">
                    <label
                      id="owner_photo2_label"
                      @click="triggerOwnerPhoto2Upload"
                      >上傳生活照2</label
                    >
                    <input
                      type="file"
                      class="form-control"
                      id="owner_photo2"
                      ref="owner_photo2"
                      :class="{ 'is-invalid': formErros.ownerPhotoUpload2 }"
                      accept="image/*"
                      @change="handleOwnerPhoto2Change($event)"
                    />
                    <div v-if="owner_photo2_preview" class="image-preview mt-3">
                      <img
                        :src="owner_photo2_preview"
                        alt="預覽圖片"
                        class="img-fluid"
                        style="max-width: 150px"
                      />
                    </div>
                    <span
                      class="invalid-feedback"
                      v-if="formErros.ownerPhotoUpload2"
                      v-html="formErros.ownerPhotoUpload2"
                    ></span>
                  </div>
                  <div class="form-group mt-3">
                    <input
                      type="text"
                      class="form-control"
                      :class="{ 'is-invalid': formErros.social_media_link }"
                      id="social_media_link"
                      style="padding: 0.375rem"
                      placeholder="影片上傳，請輸入FB、IG、YT之影片貼文連結"
                      v-model="storiesForm.social_media_link"
                    />
                    <span
                      class="invalid-feedback"
                      v-if="formErros.social_media_link"
                      v-html="formErros.social_media_link"
                    ></span>
                  </div>
                  <p class="photo_rule">
                    <span style="color: #000"
                      >*影片上傳請先發布於個人社群平台(FB/IG/YT)，並將該貼文設置為公開後提供分享連結</span
                    ><br />
                    <span style="color: #ff0000"
                      >*請至少上傳兩張與CUSTIN的生活照，生活照形式可參考網站中幸福故事集，以車主與愛車清晰合照為主</span
                    ><br />
                    *照片格式：JPG、PNG <br />
                    *檔案大小限制：5MB以下 <br />
                    *圖片尺寸：具有1280x720的解析度，寬度至少為 40像素
                    (手機皆可拍出符合上述標準之作品)
                  </p>
                  <div class="form-group">
                    <input
                      type="checkbox"
                      class="form-check-input"
                      v-model="checkPolicy"
                      :class="{ 'is-invalid': formErros.checkPolicy }"
                    />
                    <span class="agree_text">
                      我已閱讀並同意接受蒐集、處理及利用個人資料告知暨同意書內容</span
                    >
                    <span
                      class="invalid-feedback"
                      v-if="formErros.checkPolicy"
                      v-html="formErros.checkPolicy"
                    ></span>
                  </div>
                  <div
                    class="text-left post_modal_submit_btn"
                    @click="submitStory()"
                  >
                    <img src="/assets/img/post_btn.webp" alt="enter" />
                  </div>
                </div>
                <div class="col-12 rule-text pt-3">
                  <h4>/活動辦法/</h4>
                  <div class="rule-text-content">
                    <h6>■ 活動時間：</h6>
                    <p>2025/02/20起至2025/05/20止</p>
                    <h6>■ 參加資格：</h6>
                    <p>Hyundai CUSTIN 車主（以車牌號碼為認定依據）</p>
                    <h6>■ 獎項：</h6>
                    <p>
                      LINE POINTS
                      100點(50位)、CUSTIN模型車(5名)、王品集團1,000元餐券(5名)、IONIQ自動摺疊傘(5名)
                    </p>
                    <h6>■ 投稿說明：</h6>
                    <p>
                      1.
                      投稿內容包含文字故事分享(300字內)以及搭配之圖片或影音(擇一)。
                    </p>
                    <p>
                      2.
                      如選擇上傳生活照，請至少上傳兩張與CUSTIN的生活照，生活照形式可參考網站中幸福故事集，以車主與愛車清晰合照為主。
                    </p>
                    <p>
                      3.
                      照片格式：檔案需提供約5MB內，具有1280*720的解析度(寬度至少為640像素)之圖檔，JPG/PNG。(目前手機都能拍攝出的規格)。
                    </p>
                    <p>
                      4.
                      影音格式：需先將影片上傳至個人社群平台Facebook或Instagram或YouTube，並將該貼文設置為公開後提供分享連結。
                    </p>
                    <p>
                      5.
                      投稿內容須符合上述規定，未符合規定者，主辦單位保有取消投稿資格(含領獎及抽獎資格)之權利。
                    </p>
                    <p>
                      6.
                      車主應確保投稿內容無侵害任何第三人之智慧財產權，不得使用他人照片、影片或截圖，經發現後主辦單位有權立即取消其獲贈資格，相關法律責任，由投稿者自行負責。
                    </p>
                    <p>
                      7.
                      投稿內容不得含有誹謗、侮辱、不雅、威脅、攻擊、色情等違反公共秩序或善良風俗、可能損害本活動進行之病毒檔案或其他任何惡意程式以及盜用他人著作內容或以AI生成方式產生之投稿內容。
                    </p>
                    <p>
                      8.
                      車主參加本活動並提供其個人資料予主辦單位，即視為已同意主辦單位依相關法令蒐集、處理及利用車主之個人資料
                      ，且同意其投稿作品、後續相關拍攝工作等無償永久授權主辦宣傳及使用。範圍包括使用投稿內容於國內外改編、重製、發布、公開傳輸、公開播送及公開上映等。
                    </p>
                    <h6>■ 獎項說明：</h6>
                    <p>
                      1.
                      完成投稿程序後，由主辦單位確認並審閱其內容，經主辦單位通知並成功刊登者，即贈送投稿者LINE
                      POINTS
                      100點(50位)。與CUSTIN模型車(5名)、王品集團1,000元餐券(5名)、IONIQ自動摺疊傘(5名)抽獎資格乙次。
                    </p>
                    <p>
                      2. 投稿者須有LINE帳號始得獲贈LINE
                      POINTS，以填入之手機號碼透過LINE發放，若因資料有誤導致寄送失敗、逾期未完成領取，皆視同放棄以上獎品，LINE
                      POINTS之使用及折扣優惠悉依Line官方使用辦法說明。
                    </p>
                    <p>
                      3.
                      依中華民國稅法規定，機會中獎之獎項價值超過新台幣1,000元以上者，於年度結算時必須計入個人之綜合所得申報，超過新臺幣20,010(含)元以上，需預先扣繳稅款，才可兌換獎項，故獲選車主應提供相關文件予主辦單位，以利主辦單位製作扣繳憑單，始得領取本活動獎項。若獲選車主未提供資料予主辦單位，則視同放棄獲選資格，不另行通知。
                    </p>
                    <h6>■ 獲選車主須知：</h6>
                    <p>
                      1.
                      投稿內容經主辦單位評選後，合適者將安排進一步的深入訪談、攝影或錄影紀錄等，如獲選車主無法全程配合主辦單位之安排，視同放棄獲選資格。
                    </p>
                    <p>
                      2.
                      主辦單位為獲選車主安排深入訪談所拍攝之照片、影片及成果物，其智慧財產權歸屬於主辦單位所有，主辦單位不另支付報酬予獲選車主。
                    </p>
                    <p>
                      ■兌獎與寄送將由主辦單位「南陽實業股份有限公司」指定之活動小組「博報堂思索股份有限公司」統一處理相關事宜，詳細兌獎方式將於得獎者與活動小組聯繫後進行通知，並以主辦單位規劃之方式為主，僅限郵寄至台、澎、金、馬地區。主辦單位有隨時有權取消、終止、修改活動內容，亦有權對本活動之所有事宜做出最終解釋或決定，及保留最後核准與否權利。相關未盡事宜，以Hyundai官網或官方粉絲團公告為準，不另行通知。
                    </p>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>

    <section id="champion_pc" ref="champion_pc">
      <div class="row">
        <div class="col-7 champion_left">
          <img src="/assets/img/champion_title.webp" class="champion_title" />
          <img
            src="/assets/img/champion_car_left.webp"
            loading="lazy"
            class="champion_car"
          />
          <div class="champion-action-list">
            <a
              href="https://www.hyundai-motor.com.tw/testdrive.html?utm_source=officialwebsite&utm_medium=testdrive&utm_campaign=KU_event"
              target="_blank"
              ><img
                src="/assets/img/champion_testdrive.webp"
                class="champion-action testdrive"
                loading="lazy"
            /></a>
            <a
              href="https://www.hyundai-motor.com.tw/clicktobuy/custin/customize?utm_source=officialwebsite&utm_medium=clicktobuy&utm_campaign=KU_event"
              target="_blank"
              ><img
                src="/assets/img/champion_order.webp"
                class="champion-action order"
                loading="lazy"
            /></a>
            <a
              href="https://www.hyundai-motor.com.tw/clicktobuy/custin?utm_source=officialwebsite&utm_medium=clicktobuy_custin&utm_campaign=KU_event"
              target="_blank"
              ><img
                src="/assets/img/champion_more.webp"
                class="champion-action more"
                loading="lazy"
            /></a>
          </div>
        </div>
        <div class="col-5 champion_right">
          <img src="/assets/img/champion_right_1.webp" loading="lazy" />
          <p>前衛科技座艙</p>
          <img src="/assets/img/champion_right_2.webp" loading="lazy" />
          <p>感應式電動側滑門</p>
          <img src="/assets/img/champion_right_3.webp" loading="lazy" />
          <p>正七人座寬敞空間</p>
          <img src="/assets/img/champion_right_4.webp" loading="lazy" />
          <p>第二排VIP皇家座椅</p>
        </div>
      </div>
    </section>

    <section id="champion_mobile" ref="champion_mobile">
      <div class="row">
        <div class="col-12 champion_left">
          <img src="/assets/img/champion_title.webp" class="champion_title" />
          <img
            src="/assets/img/champion_car_left.webp"
            class="champion_car"
            loading="lazy"
          />
        </div>
        <div class="col-12 champion_right">
          <img src="/assets/img/champion_right_1.webp" loading="lazy" />
          <p>前衛科技座艙</p>
          <img src="/assets/img/champion_right_2.webp" loading="lazy" />
          <p>感應式電動側滑門</p>
          <img src="/assets/img/champion_right_3.webp" loading="lazy" />
          <p>正七人座寬敞空間</p>
          <img src="/assets/img/champion_right_4.webp" loading="lazy" />
          <p>第二排VIP皇家座椅</p>

          <div class="champion-action-list">
            <a
              href="https://www.hyundai-motor.com.tw/testdrive.html?utm_source=officialwebsite&utm_medium=testdrive&utm_campaign=KU_event"
              target="_blank"
              ><img
                src="/assets/img/champion_testdrive.webp"
                loading="lazy"
                class="champion-action testdrive"
            /></a>
            <a
              href="https://www.hyundai-motor.com.tw/clicktobuy/custin/customize?utm_source=officialwebsite&utm_medium=clicktobuy&utm_campaign=KU_event"
              target="_blank"
              ><img
                src="/assets/img/champion_order.webp"
                loading="lazy"
                class="champion-action order"
            /></a>
            <a
              href="https://www.hyundai-motor.com.tw/clicktobuy/custin?utm_source=officialwebsite&utm_medium=clicktobuy_custin&utm_campaign=KU_event"
              target="_blank"
              ><img
                src="/assets/img/champion_more.webp"
                loading="lazy"
                class="champion-action more"
            /></a>
          </div>
        </div>
      </div>
    </section>
  </main>
</template>
